{
	"9229780": "Topology mapping in a distributed processing system, the distributed processing system including a plurality of compute nodes, each compute node having a plurality of tasks, each task assigned a unique rank, including: assigning each task to a geometry defining the resources available to the task; selecting, from a list of possible data communications algorithms, one or more algorithms configured for the assigned geometry; and identifying, by each task to all other tasks, the selected data communications algorithms of each task in a single collective operation. The development of the EDVAC computer system of 1948 is often cited as the beginning of the computer era. Since that time, computer systems have evolved into extremely complicated devices. Today's computers are much more sophisticated than early systems such as the EDVAC. Computer systems typically include a combination of hardware and software components, application programs, operating systems, processors, buses, memory, input/output devices, and so on. As advances in semiconductor processing and computer architecture push the performance of the computer higher and higher, more sophisticated computer software has evolved to take advantage of the higher performance of the hardware, resulting in computer systems today that are much more powerful than just a few years ago.Exemplary methods, apparatus, and products for topology mapping in a distributed processing system in accordance with the present invention are described with reference to the accompanying drawings, beginning with FIG. 1. FIG. 1 sets forth example apparatus for topology mapping in a distributed processing system according to embodiments of the present invention. The apparatus of FIG. 1 includes a parallel computer (100), non-volatile memory for the computer in the form of a data storage device (118), an output device for the computer in the form of a printer (120), and an input/output device for the computer in the form of a computer terminal (122). The parallel computer (100) in the example of FIG. 1 includes a plurality of compute nodes (102). The compute nodes (102) are coupled for data communications by several independent data communications networks including a high speed Ethernet network (174), a Joint Test Action Group (`JTAG`) network (104), a global combining network (106) which is optimized for collective operations using a binary tree network topology, and a point-to-point network (108), which is optimized for point-to-point operations using a torus network topology. The global combining network (106) is a data communications network that includes data communications links connected to the compute nodes (102) so as to organize the compute nodes (102) as a binary tree. Each data communications network is implemented with data communications links among the compute nodes (102). The data communications links provide data communications for parallel operations among the compute nodes (102) of the parallel computer (100). Topology mapping in a distributed processing system according to embodiments of the present invention is generally implemented on a parallel computer that includes a plurality of compute nodes organized for collective operations through at least one data communications network. In fact, such computers may include thousands of such compute nodes. Each compute node is in turn itself a kind of computer composed of one or more computer processing cores, its own computer memory, and its own input/output adapters. For further explanation, therefore, FIG. 2 sets forth a block diagram of an example compute node (102) useful in a parallel computer capable of topology mapping in a distributed processing system according to embodiments of the present invention. The compute node (102) of FIG. 2 includes a plurality of processing cores (165) as well as RAM (156). The processing cores (165) of FIG. 2 may be configured on one or more integrated circuit dies. ",
	"9160606": "A remote access system for processing local data with a computing algorithm stores information on various computing algorithms available via the system. A remote user at a user system selects an algorithm, which is then encrypted and downloaded to the user system. The downloaded algorithm is decrypted and stored in host memory in a controlled manner. Alternatively, the selected algorithm may be offered through cloud processing, in which case the user uploads local data for cloud processing. In this case, the system manages the cloud processing at remote providers and tracks heuristic, caching, and performance. In either case, the local data is processed with input parameters from the user, and visual results are provided to the user along with a cost for storing final results of the processing. Once the user makes the required payment, the final results can be stored locally at the user system.Many industries use scientific algorithms to process data for various purposes. For example, seismic data processing services use various types of algorithms to process complex sets of data to provide seismic imaging and other services for clients. As will be appreciated, there are a host of algorithms for processing data, such as seismic data. Some algorithms require more or less resources, and some algorithms may actually be proprietary. The computing infrastructure required to process complex sets of data with scientific algorithms is not always available to the typical user. Instead, users must use an outside data processing service to process the user's data and provide results. Although current circumstances may be acceptable in some instances, users may never be able to use (or even just try out) certain algorithms for themselves without making extensive arrangements with outside parties who provide the algorithms and computing services. In the schematic diagram of FIG. 1, a remote access computing system 10 according to the present disclosure allows remote users to access any of a number of scientific computing algorithms and use a selected algorithm to process the user's local data. The system 10 provides scientific computing to remote client users, who can parameterize and visualize results of the scientific computing algorithm on local data before paying for the service. The client user can parameterize and perturb the variables and operation of the algorithm to see how the algorithm functions with the client's data. Ultimately, the client user needs to actually pay for the use of the processing and the algorithm before obtaining full results of the computation. Thus, the client user when satisfied with the visual results provided can then pay through the system 10 to save or apply their results. In general, the system 10 includes one or more system servers 30 and associated computing hardware. For ease of description, the one or more system servers 30 and components are simply referred to herein as a system server, although it will be appreciated that the system 10 can use a number of severs and components known and used in the art. The system server 30 stores information on various scientific computing algorithms 40, heuristic and historical information in a heuristic database 42, and caching details in a caching database 44. The system server 30 uses various processes or mechanisms, including an encryption mechanism 50 for encrypting the algorithms 40, a heuristic mechanism 250 for populating the heuristic database 42, and a caching mechanism 260 for populating the caching database 44. Finally, the system server 30 has various interfaces 60 to provide client users with remote access to scientific computing algorithms and computing services. Instead, in one embodiment, the system server 30 uses the encryption mechanism 50 to encrypt discrete processing components of the algorithm 40 and can use a number of security schemes to restrict access to the algorithm 40. In particular, a pre-installed client application 24 running on the user's device 20 handles download of the encrypted algorithm 40 and uses a current web or communication session and tracking in a web-based link to the system server 30 to control access to (and use of) the downloaded algorithm 40. The client application 24 can then decrypt the algorithm 40 at time of use in the host memory (i.e., RAM 28) only so that the algorithm 40 is never stored on the client's hard drive 26 or other memory location. In fact, for the purposes of encryption and security, the client application 24 can map the downloaded algorithm in the host memory under the current web session between the client system 20 and the system server 30. This mapping can keep other processes from reading from that mapped memory to access details of the algorithm 40. As will be appreciated, these and other security measures can be used to limit local access to the encrypted algorithm 40 and the processing performed on the client system 20. ",
	"9128997": "Data accessible to a first process is replicated for use by a second process. Modifications to the data during the replication process may cause algorithms requiring the values of data both before and after replication to pause. Sending the values of the datum, before and after modification, to a process that will access the replicated data enables algorithms that use both values to initiate execution without waiting for the replication process to be completed.The present invention relates to a method of replicating data managed by a data fabric communication network that interconnects the nodes of a distributed computer system and, more particularly, to a method for preventing pauses by algorithms affected by data modifications during the data replication process. A data fabric is a communication network that interconnects a plurality of distributed computation nodes of a computer system. The distributed computing nodes may be performing a plurality of processes and the data fabric enables the nodes to exchange data and use the data in the performance of the process(es) executing on the local node. The data fabric provides a data infrastructure that distributes and replicates data enabling data to be stored in a distributed memory so that the data may utilized at high rates with low latency and to be frequently updated by a plurality of processes being executed by one or more of the distributed computing nodes of the system. Distributed data caching is a central feature of a data fabric network, such as the GemFire Enterprise.RTM. data fabric from Gemstone Systems Inc. A cache provides temporary storage for data obtained from a data source enabling subsequent local use of the data without the necessity of repeatedly downloading the data from the data source. For example, a data cache may be used to temporarily store, at a local computer, data that is downloaded from an Internet web site. Latency in the use of the data is substantially reduced by the using the data in the local cache rather than downloading the data from a remote source for each use. The replication of data also provides redundant data storage for the system. If a process holding a replica of data fails, the data can be made available from other replicas held by other processes of the system. The GemFire Enterprise data fabric provides data management enabling creation of a plurality of local data caches consistent with the other data sources of the system and the updating of a plurality of replicas of the data to reflect the changes resulting from the use of the data by the nodes of a distributed system. For example, the nodes may be personal computers connected to one or more remote computers, such as a server presenting data for a website, as illustrated in FIG. 2. Components of the personal computer 110 may include, but are not limited to, a processing unit 120, a system memory 130, and a system bus 122 that couples various system components including the system memory to the processing unit. The system bus may be any of several types of bus structures including a memory bus or memory controller, a peripheral bus, and a local bus using any of a variety of bus architectures. By way of example, and not limitation, such architectures include Industry Standard Architecture (ISA) bus, Micro Channel Architecture (MCA) bus, Enhanced ISA (EISA) bus, Video Electronics Standards Association (VESA) local bus, and Peripheral Component Interconnect (PCI) bus also known as a Mezzanine bus. The computer 110 typically includes a variety of computer-readable media. Computer-readable media can be any available media that can be accessed by the computer 110 and includes both volatile and nonvolatile media, and removable and non-removable media. By way of example, and not limitation, computer-readable media may comprise computer storage media and communication media. Computer storage media includes both volatile and nonvolatile, removable and non-removable media implemented in any method or technology for storage of information such as computer-readable instructions, data structures, program modules or other data. Computer storage media includes, but is not limited to, RAM, ROM, EEPROM, flash memory or other memory technology, CD-ROM, digital versatile disks (DVD) or other optical disk storage, magnetic cassettes, magnetic tape, magnetic disk storage or other magnetic storage devices, or any other medium which can be used to store the desired information and which can accessed by the computer 110. Communication media typically embodies computer-readable instructions, data structures, program modules or other data in a modulated data signal such as a carrier wave or other transport mechanism and includes any information delivery media. The term modulated data signal means a signal that has one or more of its characteristics set or changed in such a manner as to encode information in the signal. By way of example, and not limitation, communication media includes wired media such as a wired network or direct-wired connection, and wireless media such as acoustic, RF, infrared and other wireless media. Combinations of the any of the above should also be included within the scope of computer-readable media.",
	"9019971": "A computer-implemented system and computer program product for routing at least one interest packet in a named data network including a plurality of nodes. The system comprises a mapping unit configured for mapping each of a plurality of names of a respective plurality of the data objects to one of a plurality of path labels, wherein each path label uniquely identifies a path between a source node and a destination node; and a node in operative communication with the mapping unit configured for providing an interest packet having both the name of a requested data object and one of the path labels, wherein the path label provided with the interest packet points to the requested data object at the destination node of the path label provided with the interest packet. The present disclosure relates generally to the field of routing with path labeling (in named data networks). In various examples, routing with path labeling may be implemented in one or more named data networks in the form of systems, methods and/or algorithms. In one embodiment, a method implemented in a computer system for routing at least one interest packet in a named data network including a plurality of nodes is provided, the method comprising: mapping, with the computer system, each of a plurality of names of a respective plurality of data objects to one of a plurality of path labels, wherein each path label uniquely identifies a path between a source node and a destination node; and providing, with the computer system, an interest packet having both the name of a requested data object and one of the path labels, wherein the path label provided with the interest packet points to the requested data object at the destination node of the path label provided with the interest packet. In another embodiment, a computer readable storage medium, tangibly embodying a program of instructions executable by the computer for routing at least one interest packet in a named data network including a plurality of nodes is provided, the program of instructions, when executing, performing the following steps: mapping each of a plurality of names of a respective plurality of data objects to one of a plurality of path labels, wherein each path label uniquely identifies a path between a source node and a destination node; and providing an interest packet having both the name of a requested data object and one of the path labels, wherein the path label provided with the interest packet points to the requested data object at the destination node of the path label provided with the interest packet. Referring now to FIG. 2B, an example data exchange between a consumer (e.g., consumer 203A of FIG. 2A) and a producer (e.g., producer 205A of FIG. 2A) proceeds as follow. First, (see Step 251) an application at the consumer 203A creates an interest packet stating the name of the data object that there is interest to retrieve. Given the data object name (see Step 253), the consumer 203A (or alternatively a first hop broker node, e.g., broker 207A) fills in the interest packet with an appropriate path label. The label is selected (see Step 255) from a set of path labels provided by the controller node 209 (or alternatively retrieved locally, e.g., from the cache of broker 207A). Then (see Step 257), the interest packet is forward from broker 207A to another node (e.g., broker 207F) based on the selected path label. Any broker node that has the data object locally cached can reply with the data object, without needing to forward the interest to the producer node (in this example, producer 205A). Finally (see Step 259), the data object response packet reaches the consumer node (in this example, consumer 203A) using the reverse path label (that is, a path label the reverse of the originally selected path label). Of note, the controller(s) may communicate bi-directionally with any one or more of the consumers, brokers and/or producers. \n",
	"8891541": "A method implemented in a computer system for routing at least one interest packet in a named data network including a plurality of nodes is provided. The method comprises: mapping, with the computer system, each of a plurality of names of a respective plurality of data objects to one of a plurality of path labels, wherein each path label uniquely identifies a path between a source node and a destination node; and providing, with the computer system, an interest packet having both the name of a requested data object and one of the path labels, wherein the path label provided with the interest packet points to the requested data object at the destination node of the path label provided with the interest packet.The present disclosure relates generally to the field of routing of interest packets, response packets and/or data objects over networks using path labeling (in named data networks). In various examples, routing with path labeling may be implemented in one or more named data networks in the form of systems, methods and/or algorithms.The present disclosure relates generally to the field of routing with path labeling (in named data networks). In various examples, routing with path labeling may be implemented in one or more named data networks in the form of systems, methods and/or algorithms. In one embodiment, a method implemented in a computer system for routing at least one interest packet in a named data network including a plurality of nodes is provided, the method comprising: mapping, with the computer system, each of a plurality of names of a respective plurality of data objects to one of a plurality of path labels, wherein each path label uniquely identifies a path between a source node and a destination node; and providing, with the computer system, an interest packet having both the name of a requested data object and one of the path labels, wherein the path label provided with the interest packet points to the requested data object at the destination node of the path label provided with the interest packet. In another embodiment, a computer readable storage medium, tangibly embodying a program of instructions executable by the computer for routing at least one interest packet in a named data network including a plurality of nodes is provided, the program of instructions, when executing, performing the following steps: mapping each of a plurality of names of a respective plurality of data objects to one of a plurality of path labels, wherein each path label uniquely identifies a path between a source node and a destination node; and providing an interest packet having both the name of a requested data object and one of the path labels, wherein the path label provided with the interest packet points to the requested data object at the destination node of the path label provided with the interest packet. In another embodiment, a computer-implemented system for routing at least one interest packet in a named data network including a plurality of nodes is provided, the system comprising: a mapping unit configured for mapping each of a plurality of names of a respective plurality of the data objects to one of a plurality of path labels, wherein each path label uniquely identifies a path between a source node and a destination node; and a node in operative communication with the mapping unit configured for providing an interest packet having both the name of a requested data object and one of the path labels, wherein the path label provided with the interest packet points to the requested data object at the destination node of the path label provided with the interest packet.  ",
	"8873614": "A system including a storage medium, a demodulator, and a decoder. The demodulator is configured to receive an input signal from the storage medium and demodulate the input signal. The decoder is configured to estimate data stored in the storage medium by decoding the demodulated input signal to provide an output signal. The decoder includes a filter and first and second processors. The filter is configured to generate a first equalized signal based on the output signal. The first processor is configured to, based on the first equalized signal and a first Viterbi algorithm, generate a first estimate of the data and an estimate of noise. The second processor is configured to generate a second estimate of the data based on the first estimate of the data, the estimate of the noise, and a second Viterbi algorithm. The output signal includes the second estimate of the data.The background description provided herein is for the purpose of generally presenting the context of the disclosure. Work of the presently named inventors, to the extent it is described in this background section, as well as aspects of the description that may not otherwise qualify as prior art at the time of filing, are neither expressly nor impliedly admitted as prior art against the present disclosure. Perpendicular magnetic recording (PMR) is a desired technology for hard disk drive storage due to its associated high storage densities. PMR refers to the vertical alignment of data bits on a recording medium, such as a disk. This vertical alignment provides additional space on the storage medium, thereby enabling higher recording densities. To decode the stored data on the storage medium, a trellis-based Viterbi detector is often coupled to an associated read channel and has certain performance limitations.Referring to FIG. 1, a traditional read channel detection architecture 10 is shown. The architecture 10 includes a finite impulse response (FIR) filter 12 that receives data samples r(t) and generates an equalized data signal 14. The equalized signal 14 is received by a nonlinear Viterbi (NLV) detector 16 that has an internal Viterbi algorithm to determine the most likely sequence of hidden states. The Viterbi detector 16 produces a preliminary non-return-to-zero (NRZ) data estimates 18 and final NRZ data estimates 20. The final NRZ estimates are produced after a certain amount of latency. This latency is referred to as the Viterbi path memory length. The path memory length is set sufficiently long such that the surviving paths of the Viterbi algorithm merge with high probability and the final NRZ data estimates have good reliability. A surviving path is the most likely path to a particular hidden state. The preliminary NRZ data estimates 18 have a smaller Viterbi path memory depth than the final NRZ data estimates 20 and thus are referred to as Viterbi early decisions. The early decisions are used to reconstruct the output of the FIR 12 by convolving with a partial response target or reconstruction filter 22. The preliminary NRZ data estimates 18 are received by the reconstruction filter 22 to generate reconstructed FIR outputs 24. A delay block 26 is connected between the output 28 of the FIR 12 and the reconstruction filter 22. Reconstructed FIR outputs 24 are subtracted from the delayed FIR outputs 30 of the delay block 26 to generate an error signal 32. The error signal 32 is used to calculate error gradients for timing loop, automatic again control (AGC) loop, baseline correction loop, and FIR adaptation loop purposes. A system is provided and includes a storage medium, a demodulator, and a decoder. The demodulator is configured to (i) receive an input signal from the storage medium, and (ii) demodulate the input signal. The decoder is configured to estimate data stored in the storage medium by decoding the demodulated input signal to provide an output signal. The decoder includes: a first filter configured to generate a first equalized signal based on the output signal provided by the decoder; a first processor configured to, based on the first equalized signal and a first Viterbi algorithm, generate (i) a first estimate of the data, and (ii) an estimate of noise; and a second processor configured to generate a second estimate of the data based on (i) the first estimate of the data, (ii) the estimate of the noise, and (iii) a second Viterbi algorithm. The output signal includes the second estimate of the data. In other features, a method is provided and includes: receiving an input signal from a storage medium; demodulating the input signal; and estimating data stored in the storage medium by decoding the demodulated input signal to provide an output signal. The decoding of the demodulated input signal includes: generating, via a first filter, a first equalized signal based on the output signal; based on the first equalized signal and a first Viterbi algorithm, generating (i) a first estimate of the data, and (ii) an estimate of noise; and generating a second estimate of the data based on (i) the first estimate of the data, (ii) the estimate of the noise, and (iii) a second Viterbi algorithm. The output signal includes the second estimate of the data.",
	"8838510": "A system, method and program product for selecting an algorithm and feature set to solve a problem. A perpetual analytics system is disclosed that provides a genetic algorithm for jointly selecting an algorithm and feature set to solve a problem, comprising: an evolutionary computing engine for processing data encoded as chromosomes, wherein each chromosome encodes an algorithm and a feature set; a domain knowledge store that maintains a plurality of algorithms and a plurality of features; a system for applying a generation of chromosomes to a set of data to provide a set of results; and a fitness function for evaluating the set of results to rate a performance of each chromosome in the set of chromosomes; wherein the evolutionary computing engine is adapted to evolve a subset of the set of chromosomes into a new generation of chromosomes.The accelerating data avalanche is gaining unimpeded momentum that is enabled by the commoditization of computing storage, devices, bandwidth, connectivity, processor parallelization, and processor speed. Consequently, numerous data mining algorithms are becoming available to sift through massive amounts of information. Businesses and governments that do not embrace advanced data analytics will not survive within an environment of highly connected and intelligent enterprise. Along with the advancement of data mining tools, applying the right algorithm to a problem is critical. For example, practitioners might choose a familiar algorithm for a specific problem that produces a suboptimal solution while a highly tuned system continually determines the best algorithm to apply towards a problem. Equally important, the diversity and dimensionality of data is becoming more challenging and is already intractable. Dimensionality reduction and variable selection is required to select the most important traits of data from an exhaustive set of features. However, varying algorithms will perform differently given changing feature sets. Accurately selecting an algorithm and a set of features is critical to achieve optimal performance. Currently, purely academic, complex and novel algorithms are distilling information into knowledge to solve difficult and real business challenges. However, with the growing number of regressors, classifiers and density estimators, determining which algorithm to implement on a particular problem domain currently requires extensive domain expertise. For example, illustrative algorithms include techniques based on Support Vector Machines (SVM), Neural Networks, Bayesian Belief Networks, numerous clustering algorithms, Hidden Markov Models, Case Based Reasoning, Reinforcement Learning, Regression, Mixture Models, Kernels, etc. The field of statistics produces similarly diverse methods such as Principal Component Analysis, Probability Density Functions, Discrete and Continuous distributions, hypothesis testing, etc. The present invention addresses the process of selecting an analytic algorithm or model and the features of the data of which to process. A framework of feature and algorithm selection is herein described for perpetual knowledge generation. The selection of features and algorithms to apply for a specific problem must be robust such that they can be encoded into a search and optimization problem. High dimensional searching requires careful consideration to explore the least amount of space while finding a best solution or a Pareto optimal hull. Evolutionary algorithms, modeled from nature, provide a parameterized framework for such searching. Nature provides natural systems that evolve over time within the context of an ecology. Within natural selection, the fittest members or groups of species pass their respective genes to the next generation. As such, the entire species adapts and changes as ecologies change. The best fit members defined as a combination of data features and algorithms are suited for a given environment or problem. Genetic algorithms are inspired by biology and provide robust search and optimization techniques. Genetic algorithms utilize a fitness function to measure the utility of a chromosome. Generally, a fitness function is either applied directly to a chromosome or the phenotype of the translated representation. A chromosome is a concise and natural data representation of a set of parameters. The entire set of chromosomes creates a generation. The genetic operators within the framework of the algorithm can be either binary or probabilistic. Reproduction, crossover and mutation are the three core functions that generally exist within a genetic algorithm. FIG. 1 depicts a perpetual analytic system 10 for selecting an algorithm 14 and set of features 16 based on an inputted problem 12. (It is understood that for the purposes of this disclosure, the term algorithm includes any approach for solving a problem, e.g., models, neural networks, artificial intelligence, etc.) Perpetual analytic system 10 generally includes a genetic algorithm 32 that encompasses: a domain knowledge store 18 the includes of a set of algorithms 20 and a set of features 22; one or more fitness functions 24 for determining how well a selected algorithm/feature performs; a genetic algorithm (GA) parameter determination system 26 that determines how the genetic algorithm 32 is to be implemented; and an evolutionary computer engine 34 for processing chromosomes that encode algorithm/feature sets. Also included is a training system 28 for off line and on line training and a database 30 of data relevant to the particular problem 12.",
	"8780401": "Systems and methods for processing the content of a digital image of a microscope sample. In an embodiment, identifications of algorithm(s) and digital slide image(s) may be received over a network. Parameter data may also be received for the identified algorithm(s). The identified digital slide image(s) may then be retrieved and the identified algorithm(s) may be executed to analyze the retrieved digital slide image(s). The execution of the algorithm(s) may be constrained based on the received parameter data. A system and method for processing and analyzing virtual microscopy digital images (digital slides) is provided. The system comprises an algorithm server that maintains or has access to a plurality of image processing and analysis routines. The algorithm server additionally has access to a plurality of digital slides. The algorithm server executes a selected routine on an identified digital slide and provides the resulting data. The digital slide can be accessed locally or remotely across a network. Similarly, the image processing routines can be obtained from local storage or across a network, or both. Advantageously, certain common sub-routines may be stored locally for inclusion in other local or remotely obtained routines. Support for multiple users to access the digital slide sever and execute image analysis routines is provided through a monitor process that allows multiple inbound connections and routes those connections to the appropriate module within the server for processing. Additionally, the monitor process may also restrict access to viewing or processing of digital slides by enforcing various security policies such as limitations on source network addresses, username and password authentication, and session timeouts. These and other variations in access to viewing and analyzing images provide a rich diversity in access levels that allow sharing of digital slides and demonstrations of image processing algorithms. Certain embodiments as disclosed herein provide a framework for processing and analysis of digital slide images. The system comprises an algorithm server that executes image processing instructions (referred to herein as algorithms, routines, and sub-routines) on digital slide images or sub-regions of a digital slide image. For example, one method disclosed herein allows a user to identify a digital slide image (or a sub-region thereof) and an algorithm to be used in the processing and analysis of the image. The server then executes the algorithm to process and analyze the image. The results may be provide to the screen, to a file, to a database, or otherwise presented, captured and/or recorded. Certain parameters may also be provided by the user or obtained from a data file corresponding to the particular algorithm to constrain the processing and analysis called for in the algorithm. After reading this description it will become apparent to one skilled in the art how to implement the invention in various alternative embodiments and alternative applications. However, although various embodiments of the present invention will be described herein, it is understood that these embodiments are presented by way of example only, and not limitation. As such, this detailed description of various alternative embodiments should not be construed to limit the scope or breadth of the present invention as set forth in the appended claims. FIG. 1 is a network diagram illustrating an example system 10 for image processing and analysis according to an embodiment of the present invention. In the illustrated embodiment, the system 10 comprises an algorithm server 20 that is communicatively linked with one or more remote users 50 and one or more remote image servers 60 via a network 80. The algorithm server is configured with a data storage area 40 and a plurality of local image files 30. The data storage area preferably comprises information related to the processing of digital image files, for example it may store certain analysis routines, parameters, and procedural lists of analysis routines and associated parameters, among other types of data. The local image files 30 and remote image files 70 are preferably digital slides of the type created by the ScanScope.RTM. Microscope Slide Scanner developed by Aperio Technologies, Inc. \n",
	"8671066": "A method may use a genetic algorithm to varying prediction parameters in forecasting software to obtain optimal predictions is disclosed. The method identifies parameters that can be varied and by modifying the parameters, the predictions of the forecasting software improve. The method uses sample data to train and validate the forecast and the optimal forecasting parameters are determined.Making predictions has long been a pursuit of mankind. Logically, over time, prediction methods have improved. As prediction methods have improved, more fields of endeavors have become interested in using modern prediction tools to assist with their work. However, modern prediction tools while becoming more accurate have become increasingly difficult to use and understand by virtually anyone aside from dedicated, full time prediction software experts. This has severely limited the ability to use and take full advantage of modern statistical prediction software, including using the software in medical forecasting uses. A genetic algorithm method to varying prediction parameters in forecasting software to obtain optimal predictions is disclosed. Forecasting algorithms have parameters that need to be adjusted to influence the results. The genetic algorithm adjusts the parameters and optimizes them to try to cause better results to emerge. The method identifies parameters that can be varied and by modifying the parameters, the predictions of the forecasting software change. During the modification of the parameters, real-time displays of the progress of the predictions are displayed. The method uses sample data to train and validate the forecast and to determine the optimal forecasting parameters. The method has several embodiments and in one embodiment, numerous prediction parameters are created at random. The prediction parameters are mutated and the prediction accuracy is assessed. If the accuracy is sufficient, the method may stop. If the accuracy is not sufficient, the prediction parameters are modified through a variety of ways and modified prediction parameters are created. The modified prediction parameters are then used to create predictions and the accuracy is again accessed until the accuracy hits a threshold or the method has executed for a sufficient number of times or until the accuracy is sufficient or the user decides to stop the process arbitrarily. FIG. 1 illustrates an example of a suitable computing system environment 100 that may be physically configured to operate, display device and provide a shopper interface described by this specification. It should be noted that the computing system environment 100 is only one example of a suitable computing environment and is not intended to suggest any limitation as to the scope of use or functionality of the method and apparatus of the claims. Neither should the computing environment 100 be interpreted as having any dependency or requirement relating to any one component or combination of components illustrated in the exemplary operating environment 100. In one embodiment, the device described in the specification is entirely created out of hardware as a dedicated unit that is physically transformed according to the description of the specification and claims. In other embodiments, the device executes software and yet additional embodiment, the device is a combination of hardware that is physically transformed and software. With reference to FIG. 1, an exemplary system that may be physically configured for implementing the blocks of the claimed method and apparatus includes a general purpose computing device in the form of a computer 110. Components of computer 110 may include, but are not limited to, a processing unit 120, a system memory 130, and a system bus 121 that couples various system components including the system memory to the processing unit 120. The computer 110 may operate in a networked environment using logical connections to one or more remote computers, such as a remote computer 180, via a local area network (LAN) 171 and/or a wide area network (WAN) 173 via a modem 172 or other network interface 170. In addition, not all the physical components need to be located at the same place. In some embodiments, the processing unit 120 may be part of a cloud of processing units 120 or computers 110 that may be accessed through a network. Computer 110 typically includes a variety of computer readable media that may be any available media that may be accessed by computer 110 and includes both volatile and nonvolatile media, removable and non-removable media. The system memory 130 may include computer storage media in the form of volatile and/or nonvolatile memory such as read only memory (ROM) 131 and random access memory (RAM) 132. The ROM may include a basic input/output system 133 (BIOS). RAM 132 typically contains data and/or program modules that include operating system 134, application programs 135, other program modules 136, and program data 137. The computer 110 may also include other removable/non-removable, volatile/nonvolatile computer storage media such as a hard disk drive 141 a magnetic disk drive 151 that reads from or writes to a magnetic disk 152, and an optical disk drive 155 that reads from or writes to an optical disk 156. The hard disk drive 141, 151, and 155 may interface with system bus 121 via interfaces 140, 150. However, none of the memory devices such as the computer storage media are intended to cover transitory signals or carrier waves. A user may enter commands and information into the computer 20 through input devices such as a keyboard 162 and pointing device 161, commonly referred to as a mouse, trackball or touch pad. Other input devices (not illustrated) may include a microphone, joystick, game pad, satellite dish, scanner, or the like. These and other input devices are often connected to the processing unit 120 through a shopper input interface 160 that is coupled to the system bus, but may be connected by other interface and bus structures, such as a parallel port, game port or a universal serial bus (USB). A monitor 191 or other type of display device may also be connected to the system bus 121 via an interface, such as a video interface 190. In addition to the monitor, computers may also include other peripheral output devices such as speakers 197 and printer 196, which may be connected through an output peripheral interface 190. ",
	"8650145": "In a storage system, snapshots of data are created according to a snapshot algorithm in response to writes. The snapshot algorithm is selected from among a plurality of different snapshot algorithms according to one or more criteria.A storage system, such as a storage array system or a storage area network of storage devices, can be used to store a relatively large amount of data on behalf of an enterprise (e.g., company, business, government agency, etc.). Data and software associated with users and applications can be stored in such a storage system, such that reduced local storage resources can be provided at user terminals. Protection of data stored in a storage system is desirable. One aspect of data protection is to enable recovery of data in case of faults or corruption due to hardware and/or software failures, or data corruption or loss caused by malware attacks (e.g., attacks caused by a virus or other malicious code designed to cause damage to stored data). ",
	"8140821": "A system configured to optimize access to stored chunks of data is provided. The system comprises a vLUN layer, a mapped LUN layer, and a mapping layer disposed between the vLUN and the mapped LUN. The vLUN provides a plurality of logical chunk addresses (LCAs) and the mapped LUN provides a plurality of physical chunk addresses (PCAs), where each LCA or PCA stores a respective chunk of data. The mapping layer defines a layout of the mapped LUN that facilitates efficient read and write access to the mapped LUN.Enterprises as well as individuals are becoming increasingly dependent on computers. As more and more data are generated, the need for efficient and reliable data storage systems, as well as for increased amounts of available storage, is increasing. There are a variety of systems in existence today, utilizing both local and network storage for processes such as primary and backup data storage. For example, during a backup operation, the data from the data sources are copied to the backup devices. Commonly, there is a substantial amount of data from each of the data sources that remains the same between two consecutive backups, and sometimes there are several copies of the same data. Similarly, in primary storage systems, different applications, or users of the same application, might be storing the same file, such as an email message or an operating system related file. These and other types of systems can have more available space and be more efficient if unchanged data, or data for which a duplicate already exists, is not written, or rewritten, to the storage device. Various approaches have been used to reduce the amount of information that is stored (referred to herein as), including techniques such as data compression, file deduplication, block deduplication, and delta block optimization (also referred to as delta-based deduplication). Data compression techniques are essentially transparent to applications and storage hardware and use well-known algorithms to reduce the size of files by eliminating redundant bits. Compression is capable of providing, depending on data type, significant reductions in data, as is well understood in the art. There can still be multiple copies of a given file, however, even if all of the copies are compressed, because compression cannot detect or reduce multiple copies of the same file. Delta block optimization reduces the amount of data backed up and stored from a source by attempting to determine which blocks are new and then writing only the blocks that are changed to backup. This technique does not, however, reduce multiple copies of the same file that can be written to storage by different users. File-level deduplication removes multiple copies of the same file, where duplicate files are replaced with a pointer to the unique version of the file. Typically, file-level duplication is not effective at removing files that have minor changes compared with previous versions of the file. The following presents a simplified summary in order to provide a basic understanding of one or more aspects of the invention. This summary is not an extensive overview of the invention, and is neither intended to identify key or critical elements of the invention, nor to delineate the scope thereof. Rather, the primary purpose of the summary is to present some concepts of the invention in a simplified form as a prelude to the more detailed description that is presented later. In one embodiment, the invention provides system configured to optimize access to stored chunks of data content, the system comprising: a virtual logic unit (vLUN) layer that corresponds to one of a plurality of layers in an input/output (I/O) path of a computer system, the vLUN providing a plurality of logical chunk addresses (LCAs) to layers disposed above it in the I/O path, such that the LCAs in the vLUN are the only LCAs visible to layers above the vLUN; a mapped logical unit (mapped LUN) layer disposed below the vLUN in the I/O path and being in operable communication with the vLUN, the mapped LUN associated with a plurality of physical chunk addresses (PCAs), each PCA configured to provide physical storage for a respective chunk of data; a mapping layer disposed between and in operable communication with the vLUN and the mapped LUN layers, the mapping layer defining a layout of the mapped LUN that facilitates efficient read and write access to the mapped LUN, the layout comprising: a first region comprising a set of first PCAs, each first PCA being allotted to provide physical storage for a respective first chunk of data stored at a single first corresponding LCA in the vLUN, where the first region is reserved for use only by the corresponding LCAs in the vLUN, such that, during a write operation, the first chunk of data is written directly to the first region without requiring location of or allocation of a free PCA to store the first chunk of data; a second region comprising a set of second PCAs, each second PCA being allotted to provide physical storage for a respective second chunk of data, where the second chunk of data corresponds to data that is associated with at least two LCAs; and a metadata region, the metadata region including a first portion indicating, for each LCA in the vLUN, whether the corresponding PCA is located in the first region or the second region of the mapped LUN, and a second portion providing, if the first portion indicates that the corresponding PCA is in the second region of the mapped LUN, mapping information for the LCA to the corresponding PCA in the second region, wherein at least the first portion of the metadata is available in a fast media, such that, during a read operation, the overhead required to access a chunk of data stored in the first region is zero and the maximum overhead required to access a chunk of data stored in the second region corresponds only to the overhead required to read the mapping information stored in the second portion of the metadata region. In a further embodiment, the system further comprises a data reduction engine in operable communication with the mapping layer, the data reduction engine configured to: perform a data reduction process on a first chunk of data stored in a first LCA on the vLUN so as to determine that the first chunk of data stored at the first LCA is a first unneeded chunk; remap the first LCA of the first unneeded chunk from the first PCA in the first region to a second PCA in the second region of the mapped LUN, where the remapping of the first LCA results in the physical storage associated with the first PCA no longer being required to be used to store data associated with the first LCA; and provide information to the first portion of the metadata region indicating that the corresponding PCA for the first unneeded chunk has changed from the first PCA in the first region to the second PCA in the second region. The data reduction engine is further operable to, in one embodiment, to deallocate the first PCA associated with the first unneeded chunk, the deallocation freeing the first PCA and its associated physical storage chunk for re-use by another LCA in the vLUN. In a further embodiment, the system further comprises an input/output (I/O) filter driver in operable communication with the mapped LUN, the mapping layer, and the vLUN, the I/O filter driver operable to map read and writes to LCAs in the vLUN to the corresponding first or second region in the mapped LUN. \n",
	"8055970": "According to one embodiment of the invention, a computer implemented method for computing a data integrity algorithm on a data stream comprises the acts of initializing a plurality of threads, partitioning the data stream into a plurality of data stream segments, calculating a number of data integrity values from the plurality of data stream segments, and verifying the integrity of the data stream using the data integrity values. The plurality of threads are executed at generally the same time. Each of the data integrity values are derived from an associated data stream segment. The digital transmission of data from one computing system to another has become an important facet of today's distributed computer architectures. To verify the reliability of this data following transit, a number of data integrity algorithms have been developed. These data integrity algorithms serve to ensure that data remains unaltered following transmission from one computing system to another. To accomplish this, a data integrity value may be calculated from the data integrity algorithm at the transmitting computing system and subsequently transmitted to the receiving computing system along with the data. Following receipt of the data, another data integrity value may be calculated and compared with the transmitted data integrity value. In this manner, a relatively high level of reliability of the data may be accomplished as it is transmitted from one computing system to another. According to one embodiment of the invention, a computer implemented method for computing a data integrity algorithm on a data stream comprises the acts of initializing a plurality of threads, partitioning the data stream into a plurality of data stream segments, calculating a number of data integrity values from the plurality of data stream segments, and verifying the integrity of the data stream using the data integrity values. The plurality of threads are executed at generally the same time. Each of the data integrity values are derived from an associated data stream segment. According to another embodiment of the invention, a system for computing a data integrity algorithm on a data stream comprises a computing system that is operable to initialize a plurality of threads, partition the data stream into a plurality of data stream segments, calculate a number of data integrity values from the plurality of data stream segments, and verify the integrity of the data stream using the data integrity values. The plurality of threads are executed at generally the same time. Each of the data integrity values are derived from an associated data stream segment. Some embodiments of the invention provide numerous technical advantages. Some embodiments may benefit from some, none, or all of these advantages. For example, according to one embodiment, the validity of a data stream may be verified using a data integrity algorithm in a relatively shorter period of time as compared to conventional implementations. Conventional implementations of integrity algorithm systems and methods were limited to usage of the computing abilities of only one processor. That is, a multi-processor computing system having additional computing abilities would essentially remain under-utilized, a problem that the teachings of the present invention does not have. According to some embodiments, an increase in throughput is accorded to the manner in which the data integrity algorithms are utilized. By creating multiple threads that act on multiple processors (if available), each thread executes one instance of the specified data integrity algorithm on a subset of the supplied data and computes a data integrity value for the subset that it processes. Such may be contrasted with a conventional usage of data integrity algorithms on multi-processor machines where one processor is heavily utilized while the remaining processors remain essentially idle. Thus, certain embodiments of the invention may provide for the usage of all available processors for the data integrity calculation resulting in throughput increases on multi-processor machines. Other technical advantages may be readily ascertained by one of ordinary skill in the art. \n",
	"9322223": "The present invention relates to a drill-pipe communication assembly. The drill-pipe communication assembly includes a first drill pipe and an insulated tube disposed within, and generally concentric with, the first drill pipe. A male insert is disposed within a first end of the first drill pipe and a female insert is disposed within a second end of the first drill pipe. A conductor is electrically coupled to the male insert and the female insert. The conductor extends along a length of the first drill pipe. The conductor facilitates transmission of electrical signals from the first end of the first drill pipe to the second end of the first drill pipe.The practice of drilling non-vertical wells through directional drilling (sometimes referred to as slant drilling) has become very common in energy and mining industries. Directional drilling exposes a larger section of subterranean reservoirs than vertical drilling, and allows multiple subterranean locations to be reached from a single drilling location thereby reducing costs associated with operating multiple drilling rigs. In addition, directional drilling often allows access to subterranean formations where vertical access is difficult or impossible such as, for example, formations located under a populated area or formations located under a body of water or other natural impediment. Despite the many advantages of directional drilling, the high cost associated with completing a well is often cited as the largest shortcoming of directional drilling. This is due to the fact that directional drilling is often much slower than vertical drilling due to requisite data-acquisition steps. Data acquisition requires an electrical connection to be present between a down-hole tool and surface equipment. Embedding an electrical conductor into a drill rod expedites data acquisition associated with directional drilling and reduces overall costs associated with directional drilling. The present application relates generally to drilling and mining operations and more particularly, but not by way of limitation, to a drill pipe having an insulated conductor embedded therein for transmission of data. In one aspect, the present invention relates to a drill-pipe communication assembly. The drill-pipe communication assembly includes a first drill pipe and an insulated tube disposed within, and generally concentric with, the first drill pipe. A male insert is disposed within a first end of the first drill pipe and a female insert is disposed within a second end of the first drill pipe. A conductor is electrically coupled to the male insert and the female insert. The conductor extends along a length of the first drill pipe. The conductor facilitates transmission of electrical signals from the first end of the first drill pipe to the second end of the first drill pipe.",
	"9091140": "A method for geo-steering, during directional drilling of a wellbore, including a processor, a data storage, and client devices in communication with the processor through a network. The processor can receive data from directional drilling equipment and can present that data to users in an executive dashboard. Users can send data and/or commands to the directional drilling equipment. The executive dashboard can present a portion of interest in a stratigraphic cross section for user identification of: the drill bit in the stratigraphic cross section, formations in the stratigraphic cross section, and other formation data. The method can be used to identify a projected path for the drill bit, import data, compute wellbore profiles and stratigraphic cross sections, plot actual drilling paths, overlay the actual drilling path onto the projected path, and present control buttons to the user.Before explaining the present system and associated method in detail, it is to be understood that the embodiments are not limited to the particular embodiments and that the embodiments can be practiced or carried out in various ways. One or more of the present embodiments relate to a computer assisted method for horizontal, lateral, and directional drilling using data from a drill string. The computer assisted method for horizontal, lateral, and directional drilling using data from a drill string can use a drill string extending into the earth from a drilling rig. The method can enable drilling operations to be adjusted in real time, change drilling direction, and stay on target while drilling. The method can include collecting data from the wellbore using a tool connected to the drill string of the drilling rig. The collected data can be transmitted to a system for geo-steering. The system for geo-steering can use a geo-steering processor to analyze the data in real-time. The geo steering processor can also identify a projected path for the drill string during directional drilling, using the data and storing the projected path in a data storage. The system for geo-steering can use the data to compute a wellbore profile. The wellbore profile can be a composite visualization of a plurality of true vertical depths. The system for geo-steering can compute a stratigraphic cross section for the wellbore profile. The stratigraphic cross section can include a formation dipping away from a perpendicular angle to a horizontal plane representing a surface surrounding the wellbore; a formation dipping toward the perpendicular angle to the horizontal plane representing the surface surrounding the wellbore; or combinations thereof. The system for geo-steering can plot an actual drilling path for the drill string using an actual survey from the actual drilling path. The system for geo-steering can overlay the actual drilling path onto a projected path in the stratigraphic cross section in the wellbore profile, enabling real-time updating of the actual drilling path over the projected path as an executive dashboard. The system for geo-steering can transmit the executive dashboard therefrom to the drill rig, indicating that the well bore of the drill string operated by the drill rig is on target or off target. The system for geo-steering can transmit the executive dashboard to a multidimensional simulation allowing a user to select a dimensional plot of the operation of the drill rig, allowing the drilling rig to adjust drilling in real time, with an ability to change direction and to stay on target in the wellbore within 3 to 12 hours. One or more embodiments of the method can use one or more software programs. The method can use computer software designed to import and export WITS.TM.-compliant information. WITS.TM., as used herein, stands for Wellsite Information Transfer Specification. The computer software can enable a user of the method to receive and send updated drilling and seismic survey data from a plurality of formats, such as: WITSML.TM., WITS.TM., Log ASCII Standard (LAS), different streaming formats, different logging formats, and other formats installed for use. The receiving and sending of updated drilling and seismic survey data from the plurality of formats can occur in real-time, such as in a matter of seconds. ",
	"8967295": "A data acquisition module comprising a base sized and configured for disposition within a shank of a drill bit bore and an extension protruding therefrom having electrical contacts on an exterior surface thereof for connection to electrical contacts on an interior surface of a sub secured to the bit shank. A drill bit equipped with a data acquisition module, a bottom hole assembly including a drill bit bearing a data acquisition module operably coupled to a sub secured to the drill bit, and a method of transferring data from a data acquisition module carrying a data acquisition module to a sub secured to the drill bit.The oil and gas industry expends sizable sums to design cutting tools, such as downhole drill bits including roller cone rock bits and fixed cutter bits, which have relatively long service lives, with relatively infrequent failure. In particular, considerable sums are expended to design and manufacture roller cone rock bits and fixed cutter bits in a manner that minimizes the opportunity for catastrophic drill bit failure during drilling operations. The loss of a roller cone or a polycrystalline diamond compact (PDC) cutter from a fixed cutter bit during drilling operations can impede the drilling operations and, at worst, necessitate rather expensive fishing operations. If the fishing operations fail, sidetrack-drilling operations must be performed in order to drill around the portion of the wellbore that includes the lost roller cones or PDC cutters. Thus, during drilling operations, bits are pulled and replaced with new bits out of an abundance of caution, even though significant service could still be obtained from the replaced bit. These premature replacements of downhole drill bits are expensive, since each trip out of the well prolongs the overall drilling activity, and consumes considerable manpower, but are nevertheless done in order to avoid the far more disruptive and expensive process of, at best, pulling the drill string and replacing the bit or fishing and sidetrack drilling operations necessary if one or more cones or PDC cutters are lost due to bit failure. ",
	"8164980": "A drill string component includes a box-end and a pin-end. Each end includes a signal transceiver, which are operably coupled together. Each signal transceiver communicates with another signal transceiver in another component to form a communication network in the drillstring. An end-cap may be placed in the central bore of the pin-end of a component to form an annular chamber between a side of the end-cap and a wall of the central bore of the pin-end when the end-cap is disposed in the central bore. In some embodiments, an electronics module may be placed in the annular chamber and configured to communicate with one of the signal transceivers. Accelerometer data, as well as other sensor data, at various locations along the drillstring may be sampled by the electronics module and communicated to a remote computer. Drillstring motion dynamics, such as vibration, may be determined based on the accelerometer data.The oil and gas industry expends sizable sums to design cutting tools, such as downhole drill bits including roller cone rock bits and fixed cutter bits, which have relatively long service lives, with relatively infrequent failure. In particular, considerable sums are expended to design and manufacture roller cone rock bits and fixed cutter bits in a manner that minimizes the opportunity for catastrophic drill bit failure during drilling operations. The loss of a roller cone or a polycrystalline diamond compact (PDC) from a fixed cutter bit during drilling operations can impede the drilling operations and, at worst, necessitate rather expensive fishing operations. If the fishing operations fail, sidetrack-drilling operations must be performed in order to drill around the portion of the wellbore that includes the lost roller cones or PDC cutters. Typically, during drilling operations, bits are pulled and replaced with new bits even though significant service could be obtained from the replaced bit. These premature replacements of downhole drill bits are expensive, since each trip out of the well prolongs the overall drilling activity, and consumes considerable manpower, but are nevertheless done in order to avoid the far more disruptive and expensive process of, at best, pulling the drillstring and replacing the bit or fishing and sidetrack-drilling operations necessary if one or more cones or compacts are lost due to bit failure. In one embodiment of the invention, a drill bit for drilling a subterranean formation comprises a bit body, a shank, a data analysis module, and an end-cap. The bit body carries at least one cutting element (also referred to as a blade or a cutter). The shank is secured to the bit body, is adapted for coupling to a drillstring, and includes a central bore formed therethrough. The data analysis module may be configured in an annular ring such that it may be disposed in the central bore while permitting passage of drilling fluid therethrough. Finally, the end-cap is configured for disposition in the central bore such that the end-cap has the annular ring of the data analysis module disposed therearound and provides a chamber for the data analysis module by providing a sealing structure between the end-cap and the wall of the central bore. \n",
	"7987925": "Drill bits and methods for sampling sensor data associated with the state of a drill bit are disclosed. A drill bit for drilling a subterranean formation comprises a bit body and a shank. The shank further includes a central bore formed through an inside diameter of the shank and configured for receiving a data analysis module. The data analysis module comprises a plurality of sensors, a memory, and a processor. The processor is configured for executing computer instructions to collect the sensor data by sampling the plurality of sensors, analyze the sensor data to develop a severity index, compare the sensor data to at least one adaptive threshold, and modify a data-sampling mode responsive to the comparison. A method comprises collecting sensor data by sampling a plurality of physical parameters associated with a drill bit state while in various sampling modes and transitioning between those sampling modes.",
	"7188090": "A drill-through feature is provided which provides a universal drill-through to mining model source data from a trained mining model. In order for a user or application to obtain model content information on a given node of a model, a universal function is provided whereby the user specifies the node for a model and data set, and the cases underlying that node for that model and data set are returned. A sampling of underlying cases may be provided, where only a sampling of the cases represented in the node is requested.A graphical representation may be made of a mining model applied to a data set. A request for data underlying a specified node from among said at least one node is detected. A determination is made of which cases in the data set underlie that node. Data regarding the underlying cases is provided. All data regarding the underlying cases may be provided, or, where requested, a sampling of data regarding the underlying cases is provided. One of ordinary skill in the art can appreciate that a computer or other client or server device can be deployed as part of a computer network, or in a distributed computing environment. In this regard, the present invention pertains to any computer system having any number of memory or storage units, and any number of applications and processes occurring across any number of storage units or volumes, which may be used in connection with the present invention. The present invention may apply to an environment with server computers and client computers deployed in a network environment or distributed computing environment, having remote or local storage. The present invention may also be applied to standalone computing devices, having programming language functionality, interpretation and execution capabilities for generating, receiving and transmitting information in connection with remote or local services. ",
	"7127444": "A system and method for obtaining information on a large number of files, and to view and take action on those files. The present invention compiles a report on a file system in HTML format that is displayed by a browser. The report allows users to manage their files, or portions of their files, directly from the report, relieving system administrators of this burden. The method comprises: requesting Active Reports to be run; generating a CSV formatted copy of the files in the storage mechanism; converting the CSV formatted copy of the files to an HTML formatted copy of the files; reading the HTML formatted copy of the files so that the user can view the files; loading the file data by mapping the HTML formatted copy of the files to memory into a spreadsheet-like grid; and managing the display of the report and user report requests.The present invention addresses the limitations of the prior art by providing a reporting application that is: self-contained and Web-based; allows a user to access very large number of files; and allows a user to take action on the files and see that action reflected in the report. The present invention, referred to in one embodiment as Active Reports, allows a user to obtain information on a large number of files, and to view and take action on those files. The present invention compiles a report on a file system (e.g., Windows NT/NTFS) in HTML format that is displayed by a browser on a machine. In a preferred embodiment of the present invention, the machine is an Intel processor based machine running Windows 98, Windows NT 4, Windows 2000, or Windows XP, and the browser is Microsoft Internet Explorer 5.0 or above. The report can use any file system output (e.g., an MFT Fast Scan). The report comprises grids and graphs, and both can be drilled down into supporting detail. In one embodiment, the report is displayed in a spreadsheet-like grid, with optional graphs displayed to summarize information in the grid. The report allows users to manage their files, or portions of their files, directly from the report, relieving system administrators of this burden. Thus, users can, among other actions, open, edit, explore, run, select, clear, find, delete, copy or move files. Active Reports is self-contained and Web-based, and is thus very easy to install and use. A Web server is not required, and the reporting application can be emailed. Alternatively, a user can access a Web site and use the reporting application by clicking on an icon. Once the user clicks on the icon, the program will check to see if the reporting application is installed. If it is not yet installed, it is automatically installed at this time. ",
	"7089160": "A method of creating a mathematical model which is employed in the determination of at least one work location in a multi-layered laminated circuit panel. The mathematical model for modifying drill data takes into consideration translational and rotational compensations caused by the encountered stretching or shrinking of the multi-layered panel subsequent to pressing or due to thermally processing, whereby the mathematical model may be utilized to modify drill data in order to accurately predict hole or via locations.The present invention relates to a method of creating a mathematical model which is employed in the determination of at least one work location in a multi-layered laminated circuit panel. More particularly, the invention is directed to the creation of a mathematical model for modifying drill data which takes into consideration translational and rotational compensations caused by the encountered stretching or shrinking of the multi-layered panel subsequent to pressing or due to thermally processing, whereby the mathematical model may be utilized to modify drill data in order to accurately predict hole or via locations. In the implementation of pressing and/or thermal processes employed in producing multi-layered panels for semiconductor packages, such panels frequently will stretch or shrink in non-uniformly translational and rotational aspects, and consequently may be the source of erroneous locations in the formation of holes or vias which are drilled into the panels, thereby rendering the panels unsuitable for installation in electronic packages, and subjecting the processes to economic losses for the manufactures. At times, such positional errors in the formation of fiducial holes or vias and slots by means of laser drilling are encountered when utilizing the same machine, such as a drilling apparatus, with the same drilling location set up. Currently, the only translational compensation which is incorporated into the drilling data for drill machines employed in forming holes or vias in panels, such as those for electronic packages or printed circuits, fail to provide any integrated vision systems. This renders any corrections for distortions encountered in the multi-layered panels to be difficult to attain so as to be able to compensate precisely for distortional stretching or shrinkage conditions which are encountered during the pressing or thermal processing of the panels prior to effectuating their drilling. In essence, none of the prior art patent publications are adapted to provide a method of creating a mathematical model for modifying drill data employed in the drilling of holes or vias in a multi-layered panel or printed circuit board, which takes into account both translational and rotational compensations in x and y directional planes due to the stretching or shrinking of the panels encountered due to pressing or thermal processing of the panels. Although the present invention is directed to the translation and scaling in both x and y directions, the rotational compensations generally are directed to meeting the change in the angle formed between two parallel lines subsequent to the pressing or thermal processing of the panels. In particular, the inventive concept is essentially contemplated in applying the measurement of some features of a panel, generally, preferable for each panel prior to lamination; implementing lamination of the multi-layered panels; measuring these features subsequent to lamination; utilizing an algorithm to calculate the rotation and scale of coordinate offsets which are encountered in the x and y directions; modifying the data file; and finally drilling the panel based on the modified data file of the information conveyed to a drilling apparatus or machine. Accordingly, it is an object of the present invention to derive a method for determining at least one work location in a multi-layered laminated circuit panel by providing a first circuitized core element having fiduciary marks, providing at least one additional metallic element, providing a data file having reference coordinates of the multi-layered circuit panel work locations and also having the reference coordinates of the fidicuary mark locations of the first circuitized core element with the reference coordinates of the fiduciary marks of the first circuitized core element, creating a modified work location by adjusting the data file with the rotational and scale coordinate offset of the fiduciary mark locations, and modifying the multi-layered circuit panel at the modified work location. ",
	"4390975": "Data is transmitted through a drill string by means of acoustical energy by transmitting an acoustical signal for a first predetermined interval and ceasing transmission of the signal for a second predetermined interval to represent a first binary state; ceasing transmission of the signal for a third predetermined interval to represent a second binary state; and combining transmission and cessation of transmission of the signal in binary sequences representative of borehole data.The desirability of telemetering information to the surface from a borehole while drilling has long been recognized. The best method presently in use is to cease drilling and lower an electronic instrument package into the borehole by means of a conductor cable to measure temperature, pressure, inclination, direction, etc. Borehole conditions of interest are measured and transmitted electrically up the cable to the surface where they are interpreted and displayed on surface instruments. After use the instrument and cable must be removed from the borehole before recommencing drilling in rotary drilling is used. Use can be left in place until another section of drill pipe must be added to the drill string, however, if a downhole mud motor is used to drive the drill bit. Insertion and removal of such instruments require a considerable amount of time during which drilling cannot occur. It has been estimated that elimination of such costly drilling rig down-time by means of while-drilling telemetry systems could eliminate 5% to 6% of direct production platform drilling costs in offshore platforms. The applicant has disclosed in previous patents, e.g., U.S. Pat. No. 4,019,148, utilization of an acoustical transmission system in which an acoustical signal is inserted into a drill string at one location at a nominal frequency and is detected at a second location. The signal is then repeated and retransmitted at a second nominal frequency to a second detector, where it is in turn repeated and retransmitted to a third detector located at a third position in the drill string. After the third repeater the sequence of frequencies is repeated in subsequent repeaters until the signal reaches the surface and is detected and read out. It was disclosed in U.S. application Ser. No. 644,686 now U.S. Pat. No. 4,019,148 that these nominal frequencies are in fact two frequencies that are separated by only a very small frequency difference (e.g., 20 Hz.). In that application it was disclosed that information is encoded into an intelligible form for acoustical transmission along the drill string into binary coded data according to the frequency-shift-keyed modulation (FSK) system. The information concerning borehole parameters is converted from analog or other form to digitally coded words which are used to modulate the FSK system. The FSK system represents digital data by shifting between the aforementioned two nominal frequencies. One frequency is used to represent a binary zero and the other to represent a binary one, and by shifting between the two frequencies in the proper sequence binary words can be represented. The encoded FSK signals can then be used to drive an electro-acoustical transducer, or other suitable device, which induces the desired signals into the drill string in the form of acoustical signals. Referring to FIG. 1 a diagram illustrating the transmission characteristics of a drill pipe is shown. Signal 100 is a typical FSK modulated signal having a portion 102 at a frequency F.sub.1 representing a digital one and a portion 104 at a frequency F.sub.2 representing a digital zero. Signal 106 represents a DC analog of signal 100 and has a pulse portion 108 representing the digital one and a zero level portion 110 representing the digital zero. Signal 106 is shown in two different states. State 112 shows the signal response in a nonresonant condition in the drill pipe. The signal has a relatively low level and is accompanied by a following edge 114 having a sharp drop off. Signal 116 represents the same signal in a resonant condition in a drill pipe. This signal has a relatively higher amplitude, but in this case is accompanied by a slowly decaying following edge 118. It is well known that an excitation in a resonant system will resonate while the system is being excited and will continue to resonate, although decreasing with time, long after the excitation has ceased to be applied. Following edge 118, therefore, represents the decaying portion of signal 106 in a resonant drill pipe condition. It can readily be seen that in portion 110 the signal representing the digital one is still present when in fact it is desired that the signal level be at zero in order to represent a digital zero. ",
	"9535629": "A method, computer program product and system enabling provisioning of a storage volume across network resources through the storage provisioning interface, wherein the storage provisioning interface enables provisioning of network resources to enable presentation of a provisioned storage volume, wherein the provisioned storage volume is enabled to be provisioned across a plurality of storage resources across the network resources, and wherein the provisioned storage volume is enabled to be a redundant distributed volume.A portion of the disclosure of this patent document may contain command formats and other computer language listings, all of which are subject to copyright protection. The copyright owner has no objection to the facsimile reproduction by anyone of the patent document or the patent disclosure, as it appears in the Patent and Trademark Office patent file or records, but otherwise reserves all copyright rights whatsoever. Host processor systems may store and retrieve data using a storage device containing a plurality of host interface units, disk drives, and disk interface units. Such storage devices are provided, for example, by EMC Corporation of Hopkinton, Mass. and disclosed in U.S. Pat. No. 5,206,939 to Yanai et al., U.S. Pat. No. 5,778,394 to Galtzur et al., U.S. Pat. No. 5,845,147 to Vishlitzky et al., and U.S. Pat. No. 5,857,208 to Ofek. The host systems access the storage device through a plurality of channels provided therewith. Host systems provide data and access control information through the channels to the storage device and storage device provides data to the host systems also through the channels. The host systems do not address the disk drives of the storage device directly, but rather, access what appears to the host systems as a plurality of logical disk units, logical devices or logical volumes. The logical disk units may or may not correspond to the actual physical disk drives. Allowing multiple host systems to access the single storage device unit allows the host systems to share data stored therein. In a common implementation, a Storage Area Network (SAN) is used to connect computing devices with a large number of storage devices. Management and modeling programs may be used to manage these complex computing environments. ",
	"9535618": "Data is relocated, based on an intelligent data placement algorithm, from a first storage location to a second storage location in a disk storage system. A data placement record is generated including a virtual disk location associated with the data, the second storage location, and a first sequence value. The first sequence value indicates relative sequence when compared to other sequence values. The data placement record is written to a first record location on a first tape cartridge loaded in a tape drive. The data placement records are used with data records to restore data to disk storage from tape backup.According to embodiments of the present disclosure, a method for tape backup in a disk storage environment with intelligent data placement is disclosed. The method includes relocating data, based on an intelligent data placement algorithm, from a first storage location to a second storage location in a disk storage system. The method further includes generating a data placement record including a virtual disk location associated with the data, the second storage location, and a sequence value. The sequence value indicates relative sequence when compared to other sequence values. The method further includes writing the data placement record to a record location on a first tape cartridge loaded in a tape drive. ",
	"9531905": "A scanner may perform: determining whether a target area within a data storage server is in a first type of storage area or in a second type of storage area, the first type of storage area being a storage area in which uploaded data can be accessed by using whichever of a first and a second access method, and the second type of storage area being a storage area in which uploaded data can be accessed by using the first access method but not the second access method; uploading scan data in the target area in the first type of storage area in a case where it is determined that the target area is in the first type of storage area; and informing the user of impossible designation information in a case where it is determined that the target area is in the second storage area.A scanner taught in the present specification may comprise a processor; and a memory that stores computer-readable instructions therein, the computer-readable instructions, when executed by the processor, causing the scanner to perform: determining by using first location information, in a case where the first location information indicating a target area within a data storage server is designated by a user, whether the target area is an area in a first type of storage area or an area in a second type of storage area different from the first type of storage area, the first type of storage area being a storage area in which data uploaded in the storage area can be accessed by using whichever of a first access method and a second access method being different from the first access method, and the second type of storage area being a storage area in which data uploaded in the storage area can be accessed by using the first access method but cannot be accessed by using the second access method; uploading scan data in the target area in the first type of storage area by sending an upload command, which includes scan data generated by the scanner, to the data storage server by using the first access method, in a case where it is determined that the target area is an area in the first type of storage area; and informing the user of impossible designation information in a case where it is determined that the target area is an area in the second storage area, the impossible designation information indicating that the target area cannot be designated as an area in which the scan data is to be uploaded. ",
	"9529831": "A method, system, and computer program product for managing data sets of a storage facility is disclosed. The method, system, and computer program product include determining, by analyzing a first data set, that the first data set includes a first record having padded data. To identify the padded data, the method, system, and computer program product include comparing at least a portion of the first record of the first data set with a second record of a second data set. Next, the method, system, and computer program product include removing, from the first record of the first data set, the padded data.",
	"9529550": "Techniques are described for managing access of executing programs to non-local block data storage. In some situations, a block data storage service uses multiple server storage systems to reliably store network-accessible block data storage volumes that may be used by programs executing on other physical computing systems. A group of multiple server block data storage systems that store block data volumes may in some situations be co-located at a data center, and programs that use volumes stored there may execute on other physical computing systems at that data center. If a program using a volume becomes unavailable, another program (e.g., another copy of the same program) may in some situations obtain access to and continue to use the same volume, such as in an automatic manner in some such situations. Techniques are described for managing access of executing programs to non-local block data storage. In at least some embodiments, the techniques include providing a block data storage service that uses multiple server storage systems to reliably store block data that may be accessed and used over one or more networks by programs executing on other physical computing systems. Users of the block data storage service may each create one or more block data storage volumes that each have a specified amount of block data storage space, and may initiate use of such a block data storage volume (also referred to as a volume herein) by one or more executing programs, with at least some such volumes having copies stored by two or more of the multiple server storage systems so as to enhance volume reliability and availability to the executing programs. As one example, the multiple server block data storage systems that store block data may in some embodiments be organized into one or more pools or other groups that each have multiple physical server storage systems co-located at a geographical location, such as in each of one or more geographically distributed data centers, and the program(s) that use a volume stored on a server block data storage system in a data center may execute on one or more other physical computing systems at that data center. Additional details related to embodiments of a block data storage service are included below, and at least some of the described techniques for providing a block data storage service may be automatically performed by embodiments of a Block Data Storage",
	"9542278": "A data storage device and a flash memory control method with high efficiency are disclosed. The random access memory of the data storage device is allocated to provide a collection and update area for logical-to-physical address mapping tables that correspond to logical addresses recorded into the physical-to-logical address mapping table. When recording a logical address corresponding to a new logical-to-physical address mapping table that has not appeared in the collection and update area into the physical-to-logical address mapping table, the microcontroller of the data storage device is configured to collect the new logical-to-physical address mapping table into the collection and update area and perform an update of the new logical-to-physical address mapping table within the collection and update area.A data storage device in accordance with an exemplary embodiment of the disclosure comprises a flash memory and a control unit. The flash memory provides a storage space that is divided into a plurality of blocks with each block comprising a plurality of physical pages. The control unit couples the flash memory to a host and comprises a microcontroller and a random access memory. The microcontroller is configured to build a physical-to-logical address mapping table in the random access memory for a run-time write block between the blocks of the flash memory. The microcontroller is further configured to allocate the random access memory to provide a collection and update area for logical-to-physical address mapping tables that correspond to logical addresses recorded into the physical-to-logical address mapping table. When recording a logical address corresponding to a new logical-to-physical address mapping table that has not appeared in the collection and update area into the physical-to-logical address mapping table, the microcontroller is configured to collect the new logical-to-physical address mapping table into the collection and update area and perform an update of the new logical-to-physical address mapping table within the collection and update area. When recording a logical address corresponding to an old logical-to-physical address mapping table that has appeared in the collection and update area into the physical-to-logical address mapping table, the microcontroller may be configured to perform an update of the old logical-to-physical address mapping table within the collection and update area. The microcontroller may be configured to update a logical-to-physical address mapping relationship recorded in the flash memory in accordance with the logical-to-physical address mapping tables collected and updated in the collection and update area. ",
	"9524243": "A scalable, storage cloud enabled data center includes a cluster of enterprise storage nodes. Each storage node includes a storage grid, a computation grid, and data availability and data protection modules. The data center is scaled by adding additional storage nodes to a cluster of storage nodes which are interconnected, e.g., via a hardware interface, switches, and switch-routers. In accordance with an aspect of the present invention, an apparatus comprises: a data center including a cluster of interconnected storage nodes, each storage node including: a computation grid that runs an application and a storage grid that stores data associated with the application, a channel director which retrieves data from a cache in response to a storage protocol request, a disk director that copies requested data from data storage to the cache, and an interface that enables communication between the storage grid and the computation grid for data access in support of the application; and the data center being scaled by adding additional interconnected storage nodes to the cluster. ",
	"9521002": "A method for storing digital data information on a data carrier and for reading the information therefrom uses a disk having an individual digital identifier. A signature is formed, and the information includes information items, which can be processed by a first electronic data processing device only if the identifier and the signature are in a predefined relation to one another. To supply a household appliance operated by an electric motor with process control data, while ensuring that only original data are used, the information components can be processed by a second electronic data processing device even if the signature and the identifier are not in the predefined relation to one another. Also, a household appliance operable by an electric motor, in particular a food processor, has an electronic data processing device. A system and an integrated semiconductor circuit also realize the features for storing digital data information.The object of the invention is to specify measures with which a household appliance can be supplied with process control data and/or data that are reproducible with a human-machine interface, while at the same time ensuring that only original data are used. ",
	"9514154": "Embodiments of the invention relate to a virtual file system for communicating changes in metadata associated with data archived in a data storage system to applications. An aspect of the invention concerns a system that comprises a virtual file system for storing metadata files wherein each metadata file is associated with an archived data file, and a virtual file system interface coupled to the virtual file system for exposing changes in the metadata files to the applications.The disclosure relates to a virtual file system for communicating changes in the metadata of the data archived in a data storage system to applications that access the archived data. The virtual file system may be provided in the data storage system coupled to host computers through which client computers may access the archived data, in the host computers, or in the client computers. One aspect of the disclosure concerns a system comprising a first virtual file system for storing metadata files wherein each metadata file is associated with an archived data file, and an interface coupled to the first virtual file system for exposing changes in the metadata files to applications using the archived data files. \n",
	"9457412": "Tungsten carbide drill bits for removing material from alloys and other hard materials are disclosed. A conventional drill bit is modified by removing material from the forward portion of the bit to increase the radius of the cutting edge. The drill bit is then coated with a nanostructured diamond film using a chemical vapor deposition process.A drill bit is a cutting tool for drilling a hole in a work piece made of a variety of materials, such as wood, metal, plastic, and alloys. In general, it is difficult to drill multiple holes in hard material, such as a high-strength alloy, particularly when the cutting edges of the drill bit become ineffective as the drill bit is dulled by repeated use caused by the abrasive properties of the hard material. Diamond coatings applied to the cutting edges of a drill bit have overcome some of the problems associated with drilling hard materials. However, diamond coatings on the drill bit often separates from the drill bit material (serving as substrate for the coating) after intensive and continuous use. A useful, although comparatively expensive, coating is a polycrystalline diamond (PCD) coating that is applied by brazing. To reduce cost other methods of applying diamond containing coatings are often used. However, some of the other methods of applying diamond coatings have problems with coating/substrate separation. ",
	"9448282": "A system and method are provided for selective bit-wise masking of X-values in scan channels in an integrated circuit (IC) during a built-in self test (BIST). The composite mask pattern is selectively generated according to locations of X-values identified in a simulation of the IC. The composite mask pattern is stored on the IC and cyclically maintained while being applied to the operational scan results of the IC. The composite mask pattern is recycled over a plurality of scan iterations to effectively prevent the X-values from influencing the resulting signature of the BIST that represents a functional fingerprint of the IC and minimize storage requirements for the composite mask pattern.\n",
	"9419693": "The present invention provides a method for determining a rank indication (RI) bit number, a base station, and a terminal. The method includes: determining, by a base station, indication information according to a correspondence between a terminal and the base station and a multi-input multi-output (MIMO) capability of the terminal, where the indication information includes information used by the terminal for determining a bit number occupied for sending a RI; and sending, by the base station, the indication information to the terminal, so that the terminal determines, according to the indication information, the bit number occupied for sending the RI. In the present invention, the UE and the base station agree on understanding of the bit number occupied by RI information.With reference to the first aspect, in a first possible implementation manner, the determining, by a base station, indication information according to a correspondence between a terminal and the base station and a multi-input multi-output MIMO capability of the terminal includes: when the terminal matches the base station, determining the indication information based on a multi-input multi-output MIMO capability indicated by a terminal category of the terminal or a MIMO capability indicated by a band combination of the terminal; or when the terminal does not match the base station, determining the indication information based on a MIMO capability indicated by a terminal category of the terminal. With reference to the first possible implementation manner of the first aspect, in a second possible implementation manner, the indication information includes channel quality indicator CQI report configuration information. The sending, by the base station, the indication information to the terminal includes: when the indication information is determined based on the MIMO capability indicated by the band combination of the terminal, sending first CQI report configuration information to the terminal, so that the terminal determines the bit number according to the first CQI report configuration information; or when the indication information is determined based on the MIMO capability indicated by the terminal category of the terminal, sending second CQI report configuration information to the terminal, so that the terminal determines the bit number according to the second CQI report configuration information. With reference to the first possible implementation manner of the first aspect, in a third possible implementation manner, the indication information includes CQI report configuration information. The sending, by the base station, the indication information to the terminal includes: when the indication information is determined based on the MIMO capability indicated by the band combination of the terminal, carrying first information in the CQI report configuration information, where the first information is used to instruct the terminal to deter nine the bit number based on the MIMO capability indicated by the band combination of the terminal; or when the indication information is determined based on the MIMO capability indicated by the terminal category of the terminal, instructing, by using the CQI report configuration information, the terminal to determine the bit number based on the MIMO capability indicated by the terminal category of the terminal; or when the indication information is determined based on the MIMO capability indicated by the terminal category of the terminal, carrying second information in the CQI report configuration information, where the second information is used to instruct the terminal to determine the bit number according to the MIMO capability indicated by the terminal category. \n",
	"9414078": "A method and apparatus for rate control for a constant-bit-rate finite-buffer-size video encoder is described. Rate control is provided by adjusting the size of non-intra frames based on the size of intra frames. A sliding window approach is implemented to avoid excessive adjustment of non-intra frames located near the end of a group of pictures. A measurement of power based on a sum of absolute values of pixel values is used. The power measurement is used to adjust a global complexity value, which is used to adjust the sizes of frames. The global complexity value responds to scene changes. An embodiment of the invention calculates and uses L1 distances and pixel block complexities to provide rate control. An embodiment of the invention implements a number of bit predictor block. Predictions may be performed at a group-of-pictures level, at a picture level, and at a pixel block level. An embodiment of the invention resets a global complexity parameter when a scene change occurs. A method and apparatus for rate control for a constant-bit-rate finite-buffer-size video encoder is described. Rate control is provided by adjusting the size of non-intra frames based on the expected size of future intra frames. Here, the size of a frame is the number of bits in the encoded, or compressed, frame. A sliding window approach is implemented to avoid excessive adjustment of non-intra frames located near the end of a group of pictures. A measurement of power based on a sum of absolute values of pixel values is used. The power measurement is used to adjust a global complexity value, which is used to adjust the sizes of frames. The global complexity value responds to scene changes. An embodiment of the invention calculates and uses L1 distances and pixel block complexities to provide rate control. An embodiment of the invention implements a number of bit predictor blocks. Predictions may be performed at a group-of-pictures level, at a picture level, and at a pixel block level. An embodiment of the invention resets a global complexity parameter when a scene change occurs. ",
	"9413497": "The invention relates to a method and device for testing a data link. A single-lane or multi-lane bit error tester that transmits one or more PRBS signals through the data link is augmented with a raw bit error buffer for storing bit error information for each detected error event and an error pattern analyzer. Most frequently occurring intra-lane bit error patterns, inter-lane word error patterns, and bit slip patterns are identified and their characteristics are analyzed so as to provide information indicative of root causes of the detected bit errors and bit slips. Accordingly, one aspect of the present invention relates to a method of testing a data link that enables a non-intrusive identification of probable causes of bit errors by firstly identifying bit patterns that are likely to cause bit errors and secondly by determining and providing to the user specific signal properties of the bit error patterns that are indicative of the probable causes of the bit errors. The method comprises: a) providing a first pseudo-random bit sequence (PRBS) to the input port of the data link; b) using a first PRBS analyzer connected to the output port of the data link to detect bit error events in a first received bit sequence, wherein the first received bit sequence corresponds to the first PRBS transmitted over the data link; c) for each bit error event detected by the first PRBS analyzer in at least a portion of the first received bit sequence, writing bit error information into an error buffer, wherein the bit error information comprises PRBS analyzer state information corresponding to the detected bit error event; d) using an error pattern analyzer to read the bit error information from the error buffer, to associate detected errors with specific bit patterns, and to generate therefrom error pattern analysis information that is indicative of a cause of the detected bit errors; and, e) providing the error pattern analysis information to a user. ",
	"9397786": "A system and method with a modified bit-interleaved coded modulation with iterative decoding (BICM-ID). Coded and interleaved bits are combined and coded with a second FEC code that is then mapped to a modulation format. The second FEC code may be a single parity check (SPC) and the scheme may be referred to as a SPC-BICM-ID scheme. In general, a system consistent with the present disclosure implements a modified BICM-ID scheme wherein coded and interleaved bits are combined and coded with a second FEC code that is then mapped to a modulation format. In one particularly advantageous embodiment the second FEC code may be a single parity check (SPC) and the scheme may be referred to as a SPC-BICM-ID scheme. In such an embodiment, the incoming data stream may be demultiplexed into a plurality of data streams with each of the data streams being coded with a low density parity check (LDPC) FEC code and then bit-interleaved. The bit-interleaved and coded LDPC data may then be combined and coded with the single parity check (SPC) and Gray mapped to one or more QAM symbols. Iterative decoding may be performed at the receiver to achieve bit error rate (BER) performance that improves with successive iterations. The de-mapper and second FEC decoder 404 may receive the output of the detector 402 and uses the second FEC code to reverse the mapping of data to the modulation format that occurred at the transmitter. As shown, de-mapping is performed iteratively in response to a priori log likelihood ratio (LLR) feedback from the output of the receiver, i.e. the output of the multiplexer 410 in the illustrated embodiment. The de-mapper and second FEC decoder 404 provides the de-mapped data on a data path 205 to reproduce the output of the interleaver 206 in the transmitter. The output of the de-mapper and second FEC decoder 404 is coupled to the de-interleaver 406 which reverses the bit-interleaving performed by the associated interleaver 206 in the transmitter and provides k associated outputs to the first FEC code decoders 408-1, 408-2 . . . 408-k. The de-mapper and second FEC decoder 404 also establishes and forwards extrinsic LLR information to the first FEC decoders 408-1, 408-2 . . . 408-k for use by the first FEC decoders 408-1, 408-2 . . . 408-k as a priori LLR information in decoding the inputs thereto. The first FEC code decoders 408-1, 408-2 . . . 408-k may each be configured to decode the data stream received thereby using the first FEC code and the extrinsic LLR information received from the de-mapper and second FEC decoder 404. The k decoded outputs of each of the first FEC code decoders 408-1, 408-2 . . . 408-k are coupled to a known multiplexer 410. The multiplexer 410 multiplexes the k de-mapped, de-interleaved and decoded bit streams 409-1, 409-2 . . . 409-k to produce the serial digital output 118-N of the receiver. \n",
	"9541758": "The present invention relates to a display, in particular Head-Up-Display of a vehicle, comprising an image forming unit for generating an image, an illumination means for illuminating the image forming unit and a deflecting unit for providing a user with a virtual image of the image generated by the image forming unit, wherein the image forming unit comprises a reflective LCoS--(Liquid Crystal on Silicon) display and the deflecting unit comprises a partially transmissive combiner.It is therefore an object of the present invention to provide a multi-colored display with a comparatively high contrast and a high brightness which is nevertheless compact and causes only low heating. The object of the present invention is achieved by a display, in particular Head-Up-Display of a vehicle, comprising an image forming unit for generating an image, an illumination means for illuminating the image forming unit and a deflecting unit for providing a user with a virtual image of the image generated by the image forming unit, wherein the image forming unit comprises a reflective LCoS--(Liquid Crystal on Silicon) display and the deflecting unit comprises a partially transmissive combiner. Compared to a LCD-display, the light losses in a LCoS-display are substantially smaller, so that a LCoS-display generates significantly fewer heat. According to the present invention, it is thereby advantageously possible to generate a high contrast and a particularly luminous virtual image. Simultaneously, a compact and cost-effective design of the display is feasible because there is no need for any coofing mechanisms as only low heat is generated. \n",
	"9541944": "A device for mounting a pedal of a vehicle including a support on which the pedal is mounted by a principal rotary shaft and a shearing mechanism connected to a fixed bodywork element of the vehicle, the shearing mechanism configured to radially shear off the principal shaft in a case of a displacement of the support relative to the bodywork element, to detach the pedal from the support. A secondary shaft is fixed to the pedal and is configured to position the pedal, which has been sheared off, in a new operating position.However, with this type of device for mounting, there is the not inconsiderable risk of the shearing device being triggered inadvertently for no apparent reason, whilst the vehicle is in a normal driving phase and without being subjected to any specific impact. The pedal would then become detached from its support without the driver being able to benefit from the usual function of said pedal, such as a braking or clutch function, for example. Even if the probability of seeing such a phenomenon occurring remains minimal, the consequences thereof could prove very serious in terms of injury to the body and/or damage to equipment. Thus it becomes necessary to secure the existing devices for mounting the pedal in order to prevent such potentially dangerous phenomena from occurring. ",
	"9542821": "A home security system includes an in-home system and a vehicle-mounted system, wherein the in-home system includes an in-home sensor that is mounted in a home and is capable of detect a state of the home, and an in-home communication module that is capable of communicating with the vehicle-mounted system to sense an abnormality from information of the in-home sensor, and wherein the vehicle-mounted system includes a vehicle-mounted device that is mounted on a vehicle that is capable of a vehicle outside output, and a vehicle-mounted communication module that is capable of communicating with the in-home system via the in-home communication module, and when the in-home system senses the abnormality, an instruction is received from the in-home system via the in-home communication module and vehicle-mounted communication module to deal with the abnormality using the vehicle-mounted device according to the instruction.However, in the conventional technologies as disclosed in Patent Document 1 to 3, for example, there is disclosed the system that is operated only in a state during charging such that the vehicle is connected to the home by a physical cable; there is a problem such that even if the vehicle is parked, the system do not operate when the home is not physically connected to the home. Further, in the conventional technology as disclosed in Patent Document 1, for example, there is also a problem such that a function of the security system is restricted to sensing of a suspicious person around the vehicle and to theft prevention for power and vehicle, and thus cannot deal with a case of an occurrence of abnormalities such as fire, blackout, and/or the like. Furthermore, even in the conventional technologies like Patent Documents 2 and 3, there is also a problem such that although it is possible to notify the user at home or the specified contact destination of an abnormality, when a fire, for example, occurs, it is not possible to promptly inform the neighborhood of such an abnormality. ",
	"9540101": "A vertical take-off and landing (VTOL) aircraft according to an aspect of the present invention comprises a fuselage, an empennage having an all-moving horizontal stabilizer located at a tail end of the fuselage, a wing having the fuselage positioned approximately halfway between the distal ends of the wing, wherein the wing is configured to transform between a substantially straight wing configuration and a canted wing configuration using a canted hinge located on each side of the fuselage. The VTOL aircraft may further includes one or more retractable pogo supports, wherein a retractable pogo support is configured to deploy from each of the wing's distal ends.",
	"9540066": "A foot peg assembly for a saddle-type vehicle for supporting a rider's foot while seated or standing on the vehicle comprises a mounting bracket for affixation to a frame portion of the vehicle, and a foot peg supported pivotably on the mounting bracket. The foot peg has a base and a step integral with the base extending outwardly therefrom. The base is attached pivotably to the mounting bracket for pivoting movement of the step relative to the mounting bracket. The base and the mounting bracket have mutually complementary configurations which maintain a close spacing therebetween through the range of pivoting movement of the step to substantially close the mounting bracket from entry of debris when the vehicle travels over unpaved ground surfaces.The present invention proposes to address the aforementioned problem by providing a foot peg assembly for saddle-type vehicles which has a particular configuration of components intended to substantially close the pivot mounting of the foot peg assembly from entry of mud, dirt and debris. Briefly summarized, the foot peg assembly of the present invention basically comprises a mounting bracket for affixation to a frame portion of a saddle-type vehicle, and a foot peg supported pivotably on the mounting bracket. The foot peg has a base and a step integral with the base extending outwardly therefrom, the step being configured for resting or weight-bearing support thereon of the vehicle rider's foot. The base is attached pivotably to the mounting bracket for pivoting movement of the step relative to the mounting bracket. In accordance with the invention, the base and the mounting bracket have mutually complementary configurations to maintain a close spacing therebetween through the range of pivoting movement of the step so as to substantially close the mounting bracket from entry of debris when the vehicle travels over unpaved ground surfaces. \n",
	"9539957": "A vehicle tool box assembly includes a storage area disposed in a vehicle cargo space and a tool box disposed in the storage area. The tool box includes a body having opposite first and second end walls and an upper surface extending between upper ends of the first and second end walls. A plurality of cut-outs is formed in the upper surface and configured to receive tools. A first lip extends upwardly from the upper surface at the first end wall. A second lip extends upwardly from the upper surface at the second end wall. A cover member is received by the tool box. The cover member includes a first recess received by the first lip and a second recess received by the second lip, thereby substantially preventing movement of the cover member relative to the tool box.In view of the state of the known technology, one aspect of the present invention includes a tool box for a vehicle cargo space. The tool box has a body having a first end wall, a second end wall disposed opposite the first end wall, an upper surface extending between upper ends of the first and second end walls and a lower surface extending between lower ends of the first and second end walls. A first length from the first end wall to the second end wall is greater than a second length between first and second side walls extending between the first and second end walls. A plurality of cut-outs is formed in the upper surface and configured to receive tools. A first lip extends upwardly from the upper surface at the first end wall. A second lip extends upwardly from the upper surface at the second end wall. First and second projections extend downwardly from the lower surface and are configured to locate to a spare tire disposed in the vehicle cargo space. ",
	"9539939": "An illumination apparatus for a vehicle is disclosed. The illumination apparatus comprises at least on fabric portion comprising a first photoluminescent portion having a first luminescent absorption range. The illumination apparatus further comprises a second photoluminescent portion having a second luminescent absorption range. A light source is configured to emit a first emission at a first wavelength directed toward the fabric portion, wherein the first wavelength is within the first absorption range and significantly outside the second absorption range.According to one aspect of the present invention, an illumination apparatus for a vehicle is disclosed. The illumination apparatus comprises at least on fabric portion comprising a first photoluminescent portion having a first luminescent absorption range. The illumination apparatus further comprises a second photoluminescent portion comprising a second luminescent absorption range. A light source is configured to emit a first emission at a first wavelength directed toward the fabric portion, wherein the first wavelength is within the first absorption range and significantly outside the second absorption range. ",
	"9539902": "Disclosed here is a system for a vehicle including a personal electronic device in communication with a vehicle head unit, the personal electronic device synchronized with the vehicle head unit for controlling which application icons appear on the vehicle head unit. Also disclosed is a computer storage media having embodied thereon computer-useable instructions that, when executed, perform a method, the method includes synchronizing the display of a plurality of applications that each operate a respective vehicle system between a vehicle head unit and a personal electronic device.The system and method described herein includes a personal electronic device in communication with a vehicle head unit of a vehicle such that application icons on the vehicle head unit and the personal electronic device are synchronized. The synchronization permits the vehicle head unit to be specifically configured to each user in response to the personal electronic device of that user. A system for a vehicle, according to one disclosed non-limiting embodiment, includes a personal electronic device in communication with a vehicle head unit, the personal electronic device synchronized with the vehicle head unit to control which application icons are available on the head unit and the personal electronic device. "
}