{
    "9089346": "A surgical drill bit can include a body portion that defines a central axis that extends along a first direction. The body portion can be separated along the first direction into a distal cutting segment, and a guiding segment. The body portion can include a helical flute that winds about the central axis. The helical flute can define a first outer profile along the cutting segment and a second outer profile along the guiding segment, the first outer profile has a first leading edge and a first bearing surface and the second outer profile has a second leading edge and a second bearing surface. The first leading edge can be configured to cut into bone and can be spaced from the central axis by a first length. The second leading edge can be spaced from the central axis by a second length that is less than the first length.",
    "8261632": "Methods of forming bit bodies for earth-boring bits include assembling and sintering infiltrated green components, infiltrated brown components, or infiltrated fully sintered components. Other methods include isostatically pressing a powder to form a green body substantially composed of a particle-matrix composite material, and sintering or hot isostatic pressing the green body or brown body to provide a bit body having a desired final density. Methods of forming earth-boring bits include providing a bit body substantially formed of a particle-matrix composite material and attaching a shank to the body. The body is provided by pressing a powder to form a green body and sintering the green body.",
    "9165116": "The present invention provides a data mining framework for mining high-quality structured clinical information. The data mining framework includes a data miner that mines medical information from a computerized patient record (CPR) based on domain-specific knowledge contained in a knowledge base. The data miner includes components for extracting information from the CPR, combining all available evidence in a principled fashion over time, and drawing inferences from this combination process. The mined medical information is stored in a structured CPR which can be a data warehouse.",
    "5200894": "An echo sounding system includes an acoustic gun which is mounted to the wellhead of a borehole. The acoustic gun produces an acoustic pulse which is transmitted down the borehole. A tubing string is installed in the borehole and it has substantially evenly spaced collars. Fluid is pumped from the borehole, or well, by use of a reciprocating pump driven by a pump rod extending to the surface. The acoustic pulse produces reflections when it strikes the tubing collars and the surface of the fluid. A microphone detects the reflections to produce a return signal. This signal is digitized and stored. The digitized signal is processed to detect the rate of the collar reflections and the stored signal is narrowband filtered with a passband filter centered at the rate of receipt of the collars. Each cycle of the narrowband filtered signal corresponds to one collar reflection. In this signal, each cycle is counted, and extrapolation used when necessary to produce a collar count extending from the surface to the liquid surface. This is multiplied by the average joint length to produce the depth to the liquid surface. The system further detects the liquid level and displays it as a marker on the data signal. An operator can use the automatically determined marker or move it to another position. Finally, the operator is provided with optimum operating parameters for achieving maximum production from the well.",
    "8807242": "Components, such as a cutting element for an earth-boring drilling tool include an ultrasonic transducer coupled therewith, and configured to transmit an acoustic signal therethrough, and transmit a data signal to a data acquisition unit in response to receiving a returning echo of the acoustic signals. An earth-boring drilling tool, comprises a bit body including a plurality of components, an ultrasonic transducer, and a data acquisition unit operably coupled with the ultrasonic transducer. The data acquisition unit may be configured to receive the data signal and determine a temperature distribution of the component based, at least in part, on a time-of-flight of the acoustic signals and the returning echoes. Methods for forming such components and measuring a temperature of such components may relate to coupling and implementing such an ultrasonic transducer with a component of an earth-boring drilling tool.",
    "5983163": "A method for calculating the orientation of a geologic feature with respect to the axis of a wellbore drilled through earth formations. The method uses finely detailed measurements of a selected property of the earth formations made along the wall of the wellbore. The method includes the steps of segregating the finely detailed measurements by an angle subtended with respect to an arbitrary reference on the circumference of the wellbore. The measurements are further segregated into a selected axial interval along the wellbore. For each segment, for each subtended angle, the segregated measurements are spectrally analyzed with respect to spatial frequency. Coefficients of a best fit curve are determined for the phase components of the spectrally analyzed measurements with respect to the subtended angle. The orientation of the geologic feature is calculated from the best fit curve. In the preferred embodiment a noise floor is calculated in each segment by stacking the amplitude components at each spatial frequency in each interval. For each spatial frequency, the stacked amplitude is compared to the noise floor. Only spatial frequencies having amplitudes above the noise floor are used to generate the best fit curve from their respective phase components."
}