{
    "9089346": "A surgical drill bit can include a body portion that defines a central axis that extends along a first direction. The body portion can be separated along the first direction into a distal cutting segment, and a guiding segment. The body portion can include a helical flute that winds about the central axis. The helical flute can define a first outer profile along the cutting segment and a second outer profile along the guiding segment, the first outer profile has a first leading edge and a first bearing surface and the second outer profile has a second leading edge and a second bearing surface. The first leading edge can be configured to cut into bone and can be spaced from the central axis by a first length. The second leading edge can be spaced from the central axis by a second length that is less than the first length. Certain medical procedures, such as osteosynthesis, are performed to stabilize and join bone segments to each other. Such procedures use stabilizing members such as rods or metal plates that are coupled to the bone segments by fixation elements such as bone screws, tacks, rivets, etc. Prior to the insertion of the bone screws into the bone segments, holes are pre-drilled into the bone segments using a surgical drill. Various surgical drills are currently in use that facilitate the user to drill at many speeds from several rpms up to and possible exceeding 90,000 rpms. Because of the varying speeds, the drill can behave like a milling tool and cuts into the wall of the hole thereby unintentionally and undesirably widening the diameter of the hole. This cutting effect can be compounded by chatter, vibration, axial torsion by the user, and bone quality, each of which can cause the drill to counter rotate (i.e. wobble) about a center axis of the hole. In some cases, the hole diameter increases up to 30% of the desired hole diameter. Moreover, because of the high speed in which such drills operate, heat can build up thereby causing thermal damage in the bone segments. Therefore, current drill bits not only have problems with creating repeatable hole sizes but also harm the surrounding bone while the holes are being formed. For at least these reasons, the bone screws used during osteosynthesis fixation are at risk to a degraded performance due to the unintentional loss of bone caused by standard drill bits. In an embodiment, a surgical drill bit can be configured to form a hole in an anatomical structure. The surgical drill bit can include an elongate cylindrical body portion that defines a proximal end, a distal end spaced from the proximal end along a first direction, and a central axis that extends along the first direction. The body portion can be separated along the first direction into a distal cutting segment, and a guiding segment that is proximal to the cutting segment. The body portion can include at least one helical flute that winds about the central axis from the distal end to the proximal end. The at least one helical flute can define a first outer profile along the cutting segment and a second outer profile along the guiding segment, the first outer profile can have a first leading edge and a first bearing surface and the second outer profile can have a second leading edge and a second bearing surface. The first leading edge can be configured to cut into bone and can merge with the first bearing surface such that both the first leading edge and the first bearing surface are spaced from the central axis by a first length so as to define a first radius that is substantially equal to a radius of the hole to be formed. The second leading edge can be spaced from the central axis by a second length that is less than the first length and the second bearing surface is spaced from the central axis so as to define a second radius that is substantially equal to the first radius. The second outer profile can further include a substantially straight joining surface that connects the second leading edge to the second bearing surface such that the joining surface is angled radially inward with respect to a tangent of the second bearing surface by a first angle.",
    "8261632": "Methods of forming bit bodies for earth-boring bits include assembling and sintering infiltrated green components, infiltrated brown components, or infiltrated fully sintered components. Other methods include isostatically pressing a powder to form a green body substantially composed of a particle-matrix composite material, and sintering or hot isostatic pressing the green body or brown body to provide a bit body having a desired final density. Methods of forming earth-boring bits include providing a bit body substantially formed of a particle-matrix composite material and attaching a shank to the body. The body is provided by pressing a powder to form a green body and sintering the green body. In one aspect, the present invention includes a method of forming a bit body for an earth-boring drill bit. A plurality of green powder components are provided and assembled to form a green unitary structure. At least one green powder component is configured to form a region of a bit body. The green unitary structure has the binder substantially removed therefrom, infiltrated, and sintered to a final density. The green unitary structure is at least partially sintered, infiltrated after partial sintering, and sintered to a final density. The features, advantages, and alternative aspects of the present invention will be apparent to those skilled in the art from a consideration of the following detailed description considered in combination with the accompanying drawings. ",
    "9165116": "The present invention provides a data mining framework for mining high-quality structured clinical information. The data mining framework includes a data miner that mines medical information from a computerized patient record (CPR) based on domain-specific knowledge contained in a knowledge base. The data miner includes components for extracting information from the CPR, combining all available evidence in a principled fashion over time, and drawing inferences from this combination process. The mined medical information is stored in a structured CPR which can be a data warehouse. Health care providers accumulate vast stores of clinical information. However, efforts to mine clinical information have not proven to be successful. In general, data mining is a process to determine useful patterns or relationships in data stored in a data repository. Typically, data mining involves analyzing very large quantities of information to discover trends hidden in the data. Clinical information maintained by health care organizations is usually unstructured. Therefore, it is difficult to mine using conventional methods. Moreover, since clinical information is collected to treat patients, as opposed, for example, for use in clinical trials, it may contain missing, incorrect, and inconsistent data. Often key outcomes and variables are simply not recorded. While many health care providers maintain billing information in a relatively structured format, this type of information is limited by insurance company requirements. That is, billing information generally only captures information needed to process medical claims, and more importantly reflects the billing view of the patient, i.e., coding the bill for maximum reimbursement. As a result, billing information often contains inaccurate and missing data, from a clinical point of view. Furthermore, studies show that billing codes are incorrect in a surprisingly high fraction of patients (often 10% to 20%). Given that mining clinical information could lead to insights that otherwise would be difficult or impossible to obtain, it would be desirable and highly advantageous to provide techniques for mining structured high-quality clinical information.",
    "5200894": "An echo sounding system includes an acoustic gun which is mounted to the wellhead of a borehole. The acoustic gun produces an acoustic pulse which is transmitted down the borehole. A tubing string is installed in the borehole and it has substantially evenly spaced collars. Fluid is pumped from the borehole, or well, by use of a reciprocating pump driven by a pump rod extending to the surface. The acoustic pulse produces reflections when it strikes the tubing collars and the surface of the fluid. A microphone detects the reflections to produce a return signal. This signal is digitized and stored. The digitized signal is processed to detect the rate of the collar reflections and the stored signal is narrowband filtered with a passband filter centered at the rate of receipt of the collars. Each cycle of the narrowband filtered signal corresponds to one collar reflection. In this signal, each cycle is counted, and extrapolation used when necessary to produce a collar count extending from the surface to the liquid surface. This is multiplied by the average joint length to produce the depth to the liquid surface. The system further detects the liquid level and displays it as a marker on the data signal. An operator can use the automatically determined marker or move it to another position. Finally, the operator is provided with optimum operating parameters for achieving maximum production from the well.",
    "8807242": "Components, such as a cutting element for an earth-boring drilling tool include an ultrasonic transducer coupled therewith, and configured to transmit an acoustic signal therethrough, and transmit a data signal to a data acquisition unit in response to receiving a returning echo of the acoustic signals. An earth-boring drilling tool, comprises a bit body including a plurality of components, an ultrasonic transducer, and a data acquisition unit operably coupled with the ultrasonic transducer. The data acquisition unit may be configured to receive the data signal and determine a temperature distribution of the component based, at least in part, on a time-of-flight of the acoustic signals and the returning echoes. Methods for forming such components and measuring a temperature of such components may relate to coupling and implementing such an ultrasonic transducer with a component of an earth-boring drilling tool.",
    "5983163": "A method for calculating the orientation of a geologic feature with respect to the axis of a wellbore drilled through earth formations. The method uses finely detailed measurements of a selected property of the earth formations made along the wall of the wellbore. The method includes the steps of segregating the finely detailed measurements by an angle subtended with respect to an arbitrary reference on the circumference of the wellbore. The measurements are further segregated into a selected axial interval along the wellbore. For each segment, for each subtended angle, the segregated measurements are spectrally analyzed with respect to spatial frequency. Coefficients of a best fit curve are determined for the phase components of the spectrally analyzed measurements with respect to the subtended angle. The orientation of the geologic feature is calculated from the best fit curve. In the preferred embodiment a noise floor is calculated in each segment by stacking the amplitude components at each spatial frequency in each interval. For each spatial frequency, the stacked amplitude is compared to the noise floor. Only spatial frequencies having amplitudes above the noise floor are used to generate the best fit curve from their respective phase components.",
    "9399468": "Disclosed is a feature for a vehicle that enables taking precautionary actions in response to conditions on the road network around or ahead of the vehicle, in particular, an intersection located at the bottom of a hill. A database that represents the road network is used to determine locations where an intersection of roads is located at the bottom of a hill and then, precautionary action data is added to the database to indicate such locations. A precautionary action system installed in a vehicle uses this database, or a database derived therefrom, in combination with a positioning system to take a precautionary action as the vehicle approaches such a location. The present invention relates to a method and system that enables taking a precautionary action in a vehicle, such as providing a warning to a vehicle driver about a potentially difficult or hazardous driving condition on the road network. Advanced driver assistance systems (ADAS), including active safety and fuel economy systems, have been developed to improve the comfort, efficiency, safety, and overall satisfaction of driving. Examples of these advanced driver assistance systems include adaptive headlight aiming, adaptive cruise control, lane departure warning and control, curve warning, speed limit notification, hazard warning, predictive cruise control, and adaptive shift control, as well as others. Some of these advanced driver assistance systems use a variety of sensor mechanisms in the vehicle to determine the current state of the vehicle and the current state of the roadway in front of the vehicle. These sensor mechanisms may include radar, infrared, ultrasonic and vision-oriented sensors, such as digital video cameras and lidar. Some advanced driver assistance systems also use digital map data. Digital map data can be used in advanced driver assistance systems to provide information about the road network, road geometry, road conditions and other items associated with the road and terrain around the vehicle. Digital map data is not affected by environmental conditions, such as fog, rain or snow. In addition, digital map data can provide useful information that cannot reliably be provided by cameras or radar, such as curvature, grade, bank, speed limits that are not indicated by signage, traffic and lane restrictions, etc. Further, digital map data can provide a predictive capability well beyond the range of other sensors or even beyond the driver's vision to determine the road ahead of the vehicle, around corners, over hills or beyond obstructions. Accordingly, digital map data can be a useful addition for some advanced driver assistance systems. Although these kinds of systems provide useful features, there exists room for further improvements. For example, it would be useful to identify locations on the road network where a relatively high number of traffic accidents have occurred. However, statistics pertaining to accidents are maintained by various different administrative entities that use different formats, standards, reporting methods, reporting periods, etc. Accordingly, it is difficult to obtain consistent information about traffic accidents on roads in a large geographic region, such as the entire United States or Europe. Moreover, data indicating locations where a statistically large number of traffic accidents occur may not indicate the causes of the accidents or how accidents can be avoided.",
    "8775073": "Disclosed is a feature for a vehicle that enables taking precautionary actions in response to conditions on the road network around or ahead of the vehicle, in particular, an intersection without traffic signals and without a sufficient merge lane. A database that represents the road network is used to determine locations where roads meet without a traffic signal and without a sufficient merge lane. Then, precautionary action data is added to the database to indicate a location at which a precautionary action is to be taken about the location of the insufficient merge lane. A precautionary action system installed in a vehicle uses this database, or a database derived therefrom, in combination with a positioning system to determine when the vehicle is at a location that corresponds to the location of a precautionary action. When the vehicle is at such a location, a precautionary action is taken by a vehicle system as the vehicle is approaching a location of an insufficient merge lane. Advanced driver assistance systems (ADAS), including active safety and fuel economy systems, have been developed to improve the comfort, efficiency, safety, and overall satisfaction of driving. Examples of these advanced driver assistance systems include adaptive headlight aiming, adaptive cruise control, lane departure warning and control, curve warning, speed limit notification, hazard warning, predictive cruise control, and adaptive shift control, as well as others. Some of these advanced driver assistance systems use a variety of sensor mechanisms in the vehicle to determine the current state of the vehicle and the current state of the roadway in front of the vehicle. These sensor mechanisms may include radar, infrared, ultrasonic and vision-oriented sensors, such as digital video cameras and lidar. Some advanced driver assistance systems also use digital map data. Digital map data can be used in advanced driver assistance systems to provide information about the road network, road geometry, road conditions and other items associated with the road and terrain around the vehicle. Digital map data is not affected by environmental conditions, such as fog, rain or snow. In addition, digital map data can provide useful information that cannot reliably be provided by cameras or radar, such as curvature, grade, bank, speed limits that are not indicated by signage, traffic and lane restrictions, etc. Further, digital map data can provide a predictive capability well beyond the range of other sensors or even beyond the driver's vision to determine the road ahead of the vehicle, around corners, over hills or beyond obstructions. Accordingly, digital map data can be a useful addition for some advanced driver assistance systems. ",
    "8234183": "Data mining systems and methods are disclosed for generating data that is helpful to users in selecting between items represented in an electronic data repository, such as an electronic catalog. One disclosed data mining method generates pairwise comparison data for particular pairs of items. The pairwise comparison data for a given item pair reveals a tendency of users who consider both items in the pair to select one item over the other. The pairwise comparison data may be appropriately exposed to users of the electronic repository. For instance, an item detail page for item A may be supplemented with an indication that users who view both item A and item B select item B a specified percentage of the time. Another data mining method uses item viewing histories and item purchase histories of users in combination to identify pairs of items that are good candidates for being recommended in combination.",
    "8280899": "An event is described herein as being representable by a quantified abstraction of the event. The event includes at least one predicate, and the at least one predicate has at least one constant symbol corresponding thereto. An instance of the constant symbol corresponding to the event is identified, and the instance of the constant symbol is replaced by a free variable to obtain an abstracted predicate. Thus, a quantified abstraction of the event is composed as a pair: the abstracted predicate and a mapping between the free variable and an instance of the constant symbol that corresponds to the predicate. A data mining algorithm is executed over abstracted, quantified events to ascertain a correlation between the event and another event. One of the major themes in data mining is the extraction of patterns existent in a data set. For example, data mining algorithms have been commissioned to recognize correlations in purchase patterns of consumers. For instance, a data mining algorithm can be employed to ascertain that an individual will generally purchase toothpaste if the individual also purchased a toothbrush. In another example, a data mining algorithm can be commissioned to infer sequential patterns in data. If an individual purchases a shirt, for instance, the data mining algorithm can infer that the individual will likely purchase trousers after purchasing the shirt. Such correlations in transactions can be useful in connection with product placement, marketing, etc.",
    "8882204": "The present invention relates to a novel method of retrieving gas from a gas-containing subterranean formation, the method including digging a mine shaft to reach the subterranean formation; constructing a ventilated underground control center wherein the center includes a computerized control panel, wherein the computerized control panel controls the movements of a hot head device such as a plasma torch, an electro-chemical apparatus, a hydrogenating solvent or heated ceramic particles; a hollow drill pipe; a movable hydraulic shield; a movable resin roof bolting machine; and a movable waste extrusion device; providing mining personnel to the ventilated underground control center; and allowing the mining personnel to operate the computerized control panel wherein they perform the tasks of moving the hot head device into the subterranean formation, recovering the gas, and extruding waste material into a mined-out space of the subterranean formation.",
    "5992941": "A conveyor cart for a mining machine is made from readily available components, including conventional golf cart components, and has a maximum height of 20 inches or less (e.g. about 18 inches) so that it can be effectively utilized with a continuous miner for mining ultra thin coal seams. A chassis has side rails with front and rear ends and cross pieces extending between the side rails. A first coupling mechanism, such as an eye bolt, is mounted adjacent the front end, and a second coupling mechanism, such as a pintle hook, mounted adjacent the rear end. A single axle containing a pair of inflatable golf cart wheels extends between the side rails and may be driven by a conventional golf cart transmission and an AC motor. An endless conveyor belt is mounted so that it has a top portion for conveying mined material from the continuous mining machine to the mine mouth, and a bottom portion beneath the top portion, the conveyor belt powered by an electric motor mounted to the chassis. The cart includes an electrical cord with female and male plugs at opposite ends, and can support a safety cable and an electrical cable that go from the mine mouth to the continuous miner.",
    "4453594": "A electrolytic method and its associated apparatus for in situ recovery of coal products. With this method, the recoverable coal is in physical contact with a series of two or more positive electrodes while it is isolated from a single negative electrode by an electrolytic solution. The negative electrode and positive electrode are in boreholes which are drilled and are configured in the earth such that the positive electrodes may surround the single negative electrode. An electrolyte is placed in the center borehole with the negative electrode inserted in the liquid but insulated and positioned so as not to touch the coal in the side of the borehole. All of the positive electrodes in the adjacent boreholes are serially electrically connected to each other and to the positive terminal of an electrical potential difference source. The negative electrode is connected to the negative terminal of the same power source to initiate an electrolytic reaction in the coal-bearing earth. Coal products formed by this reaction may be periodically or continuously recovered and the extracted electrolyte replaced by a fresh electrolyte. A method and its associated apparatus for recovering in situ coal from the earth utilizing electrolysis. A first borehole is drilled from the surface to the recoverable coal seam. Next, an electrolyte is introduced into the borehole. Following this, a metal (negative) electrode is mounted in the center of the borehole. This electrode is coaxial with an electrically insulated sheath and fixed in the tube so that the outside metal surface is separated from the inside of the sheath. Additional boreholes transecting the coal seam may be provided around the negative or central borehole. An expanding electrode is inserted into each of these surrounding boreholes until it is adjacent the coal seam. Once these electrodes are in place, their respective expansion devices are actuated to firmly cause them to physically engage the coal seam. On the surface, electrical contact is made with all of the electrodes in the additional boreholes, and all are connected to a common point. This point will be connected to the positive terminal of a direct current power supply, and, therefore, the whole coal seam surrounding and intersecting the central hole will be a giant positive electrode. A potential difference between the negative electrode and the common positive electrodes causes an electrolysis reaction to take place in the central hole. After electrolysis has proceeded to a point where it is carrying a significant amount of acid products, it is pumped to the surface and replaced by fresh electrolyte. The extracted coal (carboxylic acid) can then be processed as desired. Also, throughout the electrolysis, hydrogen gas, formed at the negative electrode and guided to the surface by its sheath, is pumped off and stored. Likewise, oxygen formed at the coal surface flows up to the head of the central borehole and is pumped off and stored.",
    "4323119": "Shale or the like having hydrocarbon deposits therein is exposed to a liquid carrier medium such as water or distillate. High level vibratory energy is applied to the hydrocarbon carrying shale and the liquid to cause the oil shale to comminute so as to release the hydrocarbon therefrom, the hydrocarbon itself being comminuted and suspended in the carrier liquid, which liquid is then removed and the oil separated therefrom. This invention relates to the mining of shale oil and similar hydrocarbons, and more particularly to apparatus for such mining involving the use of a carrier liquid in conjunction with sonic energy wherein the sonic energy comminutes the kerogen which is suspended in the liquid for subsequent separation therefrom. Shale oil is generally found in the form of a hydrocarbon called kerogen which is a wax-like hydrocarbon packed between multiple layers of shale. While oil shale has been a known source of oil for many years, no efficient means has been found to date for the extraction of the oil from the kerogen deposits within the shale. Mining the shale by conventional procedures, followed by above ground processing involving retorting (heating) of the kerogen, has been used to a limited degree for a number of years. However, in view of the relatively small yield of oil from each ton of shale mined and processed, this approach has been regarded as of questionable economical feasibility. Further, this approach presents the problem of disposing of large quantities of spent shale. In order to overcome these difficulties, in situ processing of oil shale has been tried experimentally in recent years. Such in situ processes of the prior art are implemented by the sinking of a shaft into the oil shale formation and then forcing hot combustion gases through the oil shale to convert the solid organic kerogen contained therein to oil which is then drawn to the surface.",
    "9544721": "Techniques for address point data mining are described. An address point data mining method, system, or program product can determine geographic coordinates of an address based on geographic locations of one or more user devices. Each user device can be a mobile device operable to determine a location using a global navigation system (e.g., GPS), wireless signal triangulation, or other techniques. During the course of a time period (e.g., a day or week), the user device can stay at a location for a significant amount of time. The system can crosscheck this location with a geocoded geographic coordinates of a registered address (e.g., a billing address) that is associated with the mobile device. The system can determine whether the geocoded geographic coordinates are accurate based on result of the crosscheck. An online map service can provide virtual maps to one or more user devices. The virtual maps can include land features (e.g., houses, office buildings, or shops). The land features can be positioned along a street in a virtual map based on their locations. To display a land feature in the virtual map, the online map service can determine a location (e.g., latitude and longitude coordinates) of the land feature by geocoding an address (e.g., a street address) of the land feature. An exemplary technique of geocoding is address interpolation. In address interpolation, the online map service can determine geographic coordinates of a street using publicly available data, determine a segment of the street (e.g., a block) using cross street information, determine a number of addresses in the segment (e.g., N street numbers) in the segment, and interpolate the geographic coordinates of each address based on geographic coordinates of the segment and the number of addresses in the segment.",
    "9478038": "A method reduces processing time required to identify locations burned by fire by receiving a feature value for each pixel in an image, each pixel representing a sub-area of a location. Pixels are then grouped based on similarities of the feature values to form candidate burn events. For each candidate burn event, a probability that the candidate burn event is a true burn event is determined based on at least one further feature value for each pixel in the candidate burn event. Candidate burn events that have a probability below a threshold are removed from further consideration as burn events to produce a set of remaining candidate burn events. A method reduces processing time required to identify locations burned by fire by receiving a feature value for each pixel in an image, each pixel representing a sub-area of a location. Pixels are then grouped based on similarities of the feature values to form candidate burn events. For each candidate burn event, a probability that the candidate burn event is a true burn event is determined based on at least one further feature value for each pixel in the candidate burn event. Candidate burn events that have a probability below a threshold are removed from further consideration as burn events to produce a set of remaining candidate burn events. In a further embodiment, a method is provide for identifying which pixels in a satellite image are part of a burn event. The method includes receiving an initial grouping of pixels that groups pixels into at least one candidate burn event, wherein each pixel in a candidate burn event is considered to be part of a contiguous burned area. An initial fire probability is assigned to each candidate burn event based on at least one input feature of the pixels grouped in each candidate burn event. The initial fire probabilities are then used to select training burn events to train a classifier. The classifier is trained based on at least one additional input feature for each pixel of the training burn events to form a trained classifier. The trained classifier is used to assign a refined fire probability to each candidate burn event. Candidate burn events that have a refined fire probability below a threshold are removed to form a refined set of candidate burn events. A system includes a memory containing initial groupings of pixels into candidate burn events and a processor. The processor assigns an initial fire probability to each candidate burn event based on a subset of features and uses the initial fire probabilities to train land cover-specific classifiers. The processor then uses the trained land cover-specific classifiers to assign a refined fire probability to each candidate burn event. The processor removes candidate burn events that have a refined fire probability below a threshold to form a refined set of candidate burn events.",
    "9460444": "A system causes display of a visual representation of a cell-based calendar having cells representing data records, where the cells have corresponding visual indicators corresponding to values of the respective data records. The cells are arranged in plural blocks corresponding to time intervals of the cell-based calendar. Event visual indicators transparently overlay cells in at least some of the plural blocks, where the event visual indicators represent events that occurred in time intervals corresponding to the at least some blocks. The events are separate from activities represented by the data records. Providing the event visual indicators transparently overlaid over the cells in the at least some blocks depict a relationship and relative impact between the data records and the events. Understanding relatively large amounts of data can pose a challenge to the enterprise. It is undesirable to have to manually review the relatively large amounts of data on a data record by data record basis. For example, if the collected/maintained data includes customer surveys, it would be undesirable to have to manually review the surveys individually to understand the content of such surveys, as having to review a large number of surveys is time consuming and can involve relatively large amounts of personnel, which can be expensive. Moreover, certain characteristics of data collected or maintained by the enterprise may be caused by external events. An external event refers to any event that is separate from the activities represented by data collected or maintained by the enterprise. For example, if the collected/maintained data includes customer surveys, then examples of external events that can affect characteristics of the customer surveys (e.g., customer scores satisfaction or other characteristics) include a promotional sale of offerings by the enterprise, failure or fault of a system (e.g., a website crashing), and so forth. It can be relatively difficult to correlate data representing certain activities of the enterprise with the external events.",
    "9367590": "A method and procedure for large-scaled Internet data mining and data analytics for consumers over the cloud. The method describes an online market place which include an authoring tool generating computer scripts, executing the script to acquire data from URL, wherein the sequence of script instructions performs extraction and transformation of data, aggregating it into a dataset, publishing it for data consumer to pair with data analytics software programs in analyzing the dataset. The current invention introduces a novel method and procedure to offer a simple approach to this complicated problem. A cloud-based market place is created to provide service to three groups of participants using three interactive components, namely, the data producer, the data consumer, and the data analytics software provider. A data producer platform is a cloud-based platform for those who are familiar with the domain knowledge to aggregate data. It offers a simple script language for novice to mine domain specific data from the Internet. The script represents a single instance of the data being collected in a discrete time moment. The platform offers an automated method for a data producer to activate the script and define the time interval for data to be acquired. Each instance of the data is a row in a data table. Data acquired over time are aggregated as time-based rows to form a dataset, and is stored in a storage system such as network attached storage (NAS), local file store, or distributive system like HADOOP, where it will be ready for use by analytic software as input source for data analytics processing. The entire process forms a business model where data producers can use the system to harvest data from the Internet, and data analytic software providers can offer analytic algorithms as ready-made and ready-use software on known datasets as an offer in a marketplace, and make the result of the data analysis available for third parties, namely, data consumer. The social network aspect offers by this market place--collaboration among data producer, data analytics software provider, and data consumer--does not exist today. This invention will result in the creation of a new kind of social network that focuses on connecting the three roles of participants for one common purpose of providing data awareness and data analytics, bringing data analytics to consumers.",
    "9256837": "Roughly described, a computer-implemented evolutionary data mining system includes a memory storing a candidate gene database containing active and shadow individuals; a gene pool processor which tests only active individuals on training data and updates their fitness estimates; a competition module which selects individuals (both active and shadow) for discarding from the gene pool in dependence upon both their updated fitness estimate and their testing experience level; and a gene harvesting module providing for deployment selected ones of the individuals from the gene pool. The gene database has an experience layered elitist pool, and individuals to compete only with other individuals in their same layer. Shadow individuals are created in each layer for active individuals that survive all competition with the layer before their testing experience exceeds the testing experience range for the layer. Applicants have recognized, however, that in some circumstances it is possible for a relatively less fit individual to enter the elitist pool and soon graduate to the next higher layer, only because the more fit individuals in the destination layer are themselves graduating out of that layer. In this way it is possible for a relatively less fit individual to remain in the candidate gene database and work its way all the way up to the top layer, at which point it is finally discarded. It can be a waste of scarce resources to continue testing individuals that will eventually be eliminated. In order to address this type of situation, roughly described, a system can be arranged to remember, in conjunction with each testing experience layer, the fitness estimates of the individuals that have survived the competitions in a particular layer for long enough that their testing experience level has now qualified them for a higher layer. These so-called shadow individuals remain involved in the fitness competitions among individuals in or entering the particular layer, until they themselves are eliminated by the competition. However, they no longer receive testing in the particular layer.",
    "9043250": "An apparatus, system and method are introduced for preserving privacy of data in a dataset in a database with a number n of entries. In one embodiment, the apparatus includes memory including computer program code configured to, with a processor, cause the apparatus to form a random matrix of dimension m by n, wherein m is less than n, operate on the dataset with the random matrix to produce a compressed dataset, form a pseudoinverse of the random matrix, and operate on the dataset with the pseudoinverse of the random matrix to produce a decompressed dataset. These and other problems are generally solved or circumvented, and technical advantages are generally achieved, by advantageous embodiments of the present invention, in which an apparatus, system and method are introduced for preserving privacy of data in a dataset in a database with a number n of entries. In one embodiment, the apparatus includes memory including computer program code configured to, with a processor, cause the apparatus to form a random matrix of dimension m by n, wherein m is less than n, operate on the dataset with the random matrix to produce a compressed dataset, form a pseudoinverse of the random matrix, and operate on the dataset with the pseudoinverse of the random matrix to produce a decompressed dataset. The foregoing has outlined rather broadly the features and technical advantages of the present invention in order that the detailed description of the invention that follows may be better understood. Additional features and advantages of the invention will be described hereinafter, which form the subject of the claims of the invention. It should be appreciated by those skilled in the art that the conception and specific embodiment disclosed may be readily utilized as a basis for modifying or designing other structures or processes for carrying out the same purposes of the present invention. It should also be realized by those skilled in the art that such equivalent constructions do not depart from the spirit and scope of the invention as set forth in the appended claims.",
    "9122728": "A method for automatically acquiring a set of data opens a searchable Internet database; initiates an automated timed search of each one of a plurality of records, each record in the plurality of record includes common criteria with the other records; retrieves information associated with the searched record; and provides the retrieved information in a desired format. Various embodiments of the invention address the issues described above by providing an automated system and method for mining text data related to businesses and/or consumers and/or places by publicly available information on the Internet. According to one embodiment, a method for automatically acquiring a set of data includes opening a searchable Internet database; initiating an automated timed search of each one of a plurality of records, where for each record in the plurality of records, a portion of the record comprises common criteria with the other records; retrieving information associated with the searched record; and providing the retrieved information in a desired format. In another embodiment, an application programming interface allowing user control includes processes for generating a record set of search criteria, each record in the set comprising a portion of common criteria; automatically executing in a searchable Internet database a search of each record in the record set; and identifying and retrieving search results for each record searched. These and other features and advantages of aspects of the present invention will become apparent to those skilled in the art from the following detailed description, where it is shown and described illustrative embodiments, including best modes contemplated for carrying out the invention. As it will be realized, the various aspects of the invention are capable of modifications in various obvious respects, all without departing from the spirit and scope of the present invention. Accordingly, the drawings and detailed description are to be regarded as illustrative in nature and not restrictive.",
    "9009656": "Embodiments of the present invention address deficiencies of the art in respect to code reuse management and provide a method, system and computer program product for source code archival adapter for structured data mining In one embodiment of the invention, a method for adapting archived source code for structured data mining for source code reuse can be provided. The method can include parsing source code to identify individual classification elements within the source code, generating a markup language formatted set of code constructs corresponding to the classification elements, and storing the markup language formatted set of code constructs in a source code archive. The method further can include indexing the markup language formatted set of code constructs in the source code archive, and keyword searching the indexed markup language formatted set of code constructs to locate code constructs of interest. Once code constructs of interest have been located, the method can include retrieving the located code constructs of interest, and transforming the retrieved code constructs of interest into source code suitable for code reuse in a software development project.",
    "9009199": "The present invention relates to a method computer program product for datamining with constant search time, the method and computer program product comprises the steps of: traversing a search tree to a leave, retrieving a one or more data store identifier from said leave, read data pointed to by said data store identifier, locating one or more value in said data, referencing one or more data descriptor, retrieve the n-nearest data descriptor neighbors, terminate said search. The present invention, in the present context called the NV-tree (Nearest Vector tree) is a data structure designed to provide efficient approximate nearest neighbor search in very large high-dimensional collections. Specifically, the indexing technique is based on a combination of projections to lines through the high-dimensional space and repeated segmentation of those lines. The resulting index structure is stored on a data store in a manner which allows for extremely efficient search, requiring only one data store access per query data signature. In essence, it transforms costly nearest neighbor searches in the high-dimensional space into efficient uni-dimensional accesses using a combination of projections of data signatures to lines and partitioning of the projected space.",
    "8990145": "A first data mining model and a second data mining model are compared. A first data mining model M1 represents results of a first data mining task on a first data set D1 and provides a set of first prediction values. A second data mining model M2 represents results of a second data mining task on a second data set D2 and provides a set of second prediction values. A relation R is determined between said sets of prediction values. For at least a first record of an input data set, a first and second probability distribution is created based on the first and second data mining models applied to the first record. A distance measure d is calculated for said first record using the first and second probability distributions and the relation. At least one region of interest is determined based on said distance measure d. The invention provides a method for running a data mining model comparison engine for comparing a first data mining model with a second data mining model. The method comprises the following steps: providing a first data mining model representing results of a first data mining task on a first data set, said first data mining model providing a set of first prediction values; providing a second data mining model representing results of a second data mining task on a second data set, said second data mining model providing a set of second prediction values; providing a relation between said set of first prediction values and said set of second prediction values; determining an input data set; carrying out the following steps on at least a first record of the determined input data set: creating a first probability distribution based on the first data mining model applied to the first record, said first probability distribution associating probabilities with said set of first prediction values; creating a second probability distribution based on the second data mining model applied to the first record, said second probability distribution associating probabilities with said set of second prediction values; calculating a distance measure for said first record using the first and second probability distributions and the relation; determining at least one region of interest based on the distance measure calculated for records of the determined input data set.",
    "8989910": "Methods, machine-readable media, apparatuses and systems are provided to collect and analyze data relating to energy consumption and factors affecting energy production. In various embodiments, such analysis can include time series analysis, multivariate correlation analysis, cluster analysis, anomaly detection methods, multi-dimensional density analysis and demand modeling.",
    "8775423": "One or more devices store in a memory, customer tags originating on an external social platform and employee tags originating on an internal social platform. The one or more devices provide to a user device, keyword suggestions for new content to be published on the internal social platform. The keyword suggestions include selections from both the customer tags and the employee tags. The one or more devices receive employee metadata, for content published on the internal social platform, that includes tags selected from the keyword suggestions, and associates the tags in the employee metadata as customer-originated tags or employee-originated tags based on the stored customer tags and employee tags. The one or more devices perform data correlation to determine relationships between use of the customer-originated tags and use of the employee-originated tags in the employee metadata. In one implementation, one or more devices may store in a memory, customer tags originating on an external social platform and employee tags originating on an internal social platform. The one or more devices may provide, to a user device, keyword suggestions for new content to be published on the internal social platform. The keyword suggestions may include selections from both the customer tags and the employee tags. The one or more devices may receive employee metadata, for content published on the internal social platform, that includes tags selected from the keyword suggestions, and may associate the tags in the employee metadata as customer-originated tags or employee-originated tags based on the stored customer tags and employee tags. The one or more devices may perform data correlation to determine relationships between use of the customer-originated tags and use of the employee-originated tags in the employee metadata.",
    "8688732": "Comparative decision systems and methods are disclosed for gathering and mining data representative of purchase decisions. One disclosed comparative decision system detects when a user is comparing items and provides the user with the ability to create a research note storing comparative information for the alternative items. The system displays information about items according to a variety of factors. The user can customize the factors and enter information for each alternative item according to the various factors. Some information may be pre-populated by the system. The research note may be made visible to other users, and may be suggested to another user based on the note's expected helpfulness and relevance to that user. One disclosed method for mining data stored within research notes identifies which factors are given higher relative priorities by users considering a purchase. Another mining method analyzes the effects of price changes on item popularity. Web-based customer reviews are frequently used by individuals in researching potential purchases. Customers who leave reviews are often themselves in the position of researching a variety of alternatives before deciding upon their eventual purchase. Potential customers, also referred to as users, may consider a number of alternative purchases and gather a variety of information to assist with their comparison and eventual decision. A user may consider a combination of factors, such as price, availability, features, and reviews (including their content and reliability), in making her purchase decision. Users' methods for keeping track of such comparisons can vary. Some users may mentally store and compare information about the alternatives under consideration. Others may use crude notes on paper, in a word processor or in a spreadsheet.",
    "4878712": "Coal is mined using water jets to a remove a layer of thin horizontal slices of coal. The thickness of the layer is sufficiently small that elastic deformation of the roof of the layer due to settling will cause the roof to rest against the floor of the layer. A number of additional layers of slices are then extracted in the same manner, each immediately below the floor of the preceding layer. The thickness and location of these layers wiht respect to previous layers is such that elastic deformation of the roof of the first layer due to settling will cause the roof to rest against the floor of the last layer of slices. Through the sequential mining of layers in this manner from top to bottom, the entire seam of coal is extracted and the mine roof rests upon the mine floor without the need for artificial roof support. This invention provides a method of mining coal using water jets to a remove a series of thin horizontal slices of coal in a substantially horizontal plane. The upper and lower surfaces of these slices form a substantially continuous roof and floor, respectively, above and below the slices. The thickness of the slices is sufficiently small that elastic downward deformation of the roof caused by settling will result in a portion of the roof resting against a portion of the floor. This allows the integrity of the mine roof to be maintained. A number of additional layers are then extracted, each layer consisting of a number of thin horizontal slices of coal in a substantially horizontal plane immediately below the floor of the preceding layer of slices. Once again, the thickness of these slices and the location of these slices with respect to previous layers is such that elastic deformation of the roof of the first layer caused by settling will result in a portion of the roof being supported by a portion of the floor of the last layer of slices. Through the sequential mining of layers in this manner from top to bottom, the entire seam of coal is extracted and the mine roof rests upon the mine floor without the need for artificial roof support. This provides substantial advantages in terms of economic savings to the mine operator. Furthermore, due to the fact that miners do not need to enter the areas of the coal seam being excavated, the present method provides improved safety conditions for the miners. Another advantage of the present invention is the fact that any subsidence of the surface of the earth caused by mining coal in accordance with the present method will occur within a relatively short period of time following excavation of the coal deposit. In contrast, conventional coal mines can continue to cause unpredictable surface subsidence for decades following abandonment of the mine as artificial roof supports gradually fail.",
    "5871260": "A continuous mining machine is provided for mining ultra thin coal seams, e.g. seams having a thickness of about 24 inches or less. A chassis supported by crawler tracks has a substantially horizontal axis powered cutter head mounted to its front and a conveyor extending from a gathering head toward the rear of the chassis. The conveyor includes a conveyor chain driven by at least one motor near the rear of the chassis for driving a sprocket. The gathering head includes a pair of counter-rotating discs with upstanding vanes and a deck having a maximum angle of about 10.degree. with respect to the dimension of elongation of the chassis. A small diameter idler sprocket for the conveyor chain is mounted beneath the deck, and a small diameter drive sprocket is provided for the cutting chain of the cutting head. The mining machine is controlled to keep it within a coal seam to be cut by using a first color video camera scanning the ceiling of the bore cut by the miner, and a second color video camera facing the floor. The mining machine may be used in a method of mining in which, after formation of a main bore of about 300-600 feet long, during withdrawal the machine forms a number of angled bores each roughly as long as the length of the machine. There are literally millions of tons of coal in the United States alone that are found in thin coal seams (having a thickness of about four feet or less), and ultra thin coal seams (having a thickness of around two feet or less). Utilizing conventional equipment and techniques the vast majority of this coal is unrecoverable. While auger miners can be successful in thin and ultra thin seams, augers are very limited in the depth of bore they can form (typically limited to about 150 feet), and because of the circular bores that they form leave a great deal of coal between penetrations. It was for that reason that the continuous mining machine in U.S. Pat. No. 3,874,735 (the disclosure of which is hereby incorporated by reference herein) was developed. That mining machine, marketed in commercial form by Lee-Norse under the trade designations CM245 and CM285, is the shortest continuous miner (non-auger) believed to ever have been commercialized. For example the CM245 has a chassis height of only about 24 inches, and can be used in coal seams as thin as 30 inches. While that machine is a significant advance in the art and has great functionality for a number of thin coal seams, its design makes it--as a practical matter--impossible to reduce its size further to allow it to be used in ultra thin coal seams.",
    "4968098": "A continuous mining apparatus such as a coal milling or shearing machine includes sensors mounted on the machine frame or on the cutter bits, including an accelerometer and one or more strain gauges, for sensing vibrations and stresses exerted on the cutter bits during operation of the machine. A signal conditioning and amplification circuit provides an audio and/or visual display indicating when the cutter is moving outside of the coal seam and/or is cutting along a cleat or other joint to improve excavation rates while maintaining or lowering stress levels on the cutter bits. The display enables the machine operator to keep from penetrating the roof or floor of the coal seam and to position the cutter to take advantage of natural fracture lines in the seam. The frequency spectrum of the sensor signals is determined to distinguish vibrations caused by bit interaction with the material being cut. The present invention provides a system and method for detecting a change in milling or similar cutting operations for the mining of coal and similar minerals. In accordance with one aspect of the present invention, there is provided a system associated with a coal milling or shearing machine which detects strains and vibrations of the machine cutting elements to provide a signal indicating a change in the cutting forces exerted on the coal seam to minimize the excursion of the cutting machine out of the coal seam. The system of the present invention is also operable to detect the relative resistance to the cutting effort whereby the cutting operation may be conducted along faults or discontinuities in the seam such as are formed by cleats or slips to improve the rate of excavation of the coal and minimize the stresses imposed on the cutting equipment."
}